[{"title": "Burger Salad", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/burger-salad-recipe-7486414", "image_url": "https://www.simplyrecipes.com/thmb/51YaI9be9mgHYMZRgMBaoyzRueo=/450x300/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Burger-Salad-LEAD-05-c8c06ad1c710498a98b8f1141fadbf97.jpg", "ingredients": ["1 pound ground beef", "2 teaspoons burger seasoning", "Avocado oil cooking spray Avocado oil cooking spray Avocado oil cooking spray"], "instructions": ["Shape the burgers:  \n\nDivide the ground beef into 4 even portions. Using your hands or a burger mold, shape them into patties about 4 inches in diameter and 1/2” thick. Sprinkle the burger seasoning onto both sides of each patty (1/4 teaspoon per side).\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante", "Cook the burgers:  \n\nHeat a large, heavy-bottomed skillet over medium-high heat for about 3 minutes. Spray the pan with avocado oil, then add the burger patties. Let them sear for 3 minutes, or until they are well browned and will release easily from the pan. \n\n\nUse a thin, flexible spatula to flip the burgers. Leave them to cook for 3 minutes more, without moving them around, until they are well seared on both sides and still just a bit pink in the middle (you can cut one open to test, if you like, or use an instant read thermometer and refer to the temperature guide here). Remove the patties to a dish to rest.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante", "While the burgers are cooking, make the dressing:   \n\nIn a small mixing bowl, stir together the mayo, ketchup, mustard, relish, garlic powder, onion powder, and pepper until evenly combined.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante", "Assemble and serve the salads:   \n\nIn four wide, shallow bowls, arrange the lettuce, onion, tomato, pickle chips, and cheddar cheese. (I like to sprinkle each ingredient evenly around the bowl rather than making piles of ingredients, so each bite gets some of everything.) Top each salad with one of the burger patties, then drizzle a few tablespoons of the burger sauce onto each salad, to taste. Top each salad with a couple grinds of black pepper and serve right away.\n\n\nLove the recipe? Leave us stars and a comment below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Coco Morante"]}, {"title": "Sheet Pan Grilled Cheese Sandwiches", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/sheet-pan-grilled-cheese-sandwiches-recipe-7481663", "image_url": "https://www.simplyrecipes.com/thmb/fHxk3XH3SpPIYC5-JREHp2ixmU0=/450x300/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2020__01__Grilled-Cheese-LEAD-1-1426a63ea1514aee8c9e70bb8dfa00de.jpg", "ingredients": ["3 ounces unsalted butter", "2 tablespoons herbed goat cheese", "10 slices white bread", "5 slices sharp white cheddar cheese", "5 slices provolone cheese", "5 Swiss cheese slices"], "instructions": ["Preheat the oven and prepare a baking sheet:  \n\nPreheat the oven to 425°F with a rack in the upper third of the oven. Place the butter on a rimmed baking sheet and place in the preheated oven until the butter melts, about 5 minutes.", "Assemble the sandwiches and bake:  \n\nSpread goat cheese evenly on 5 of the bread slices.\n\n\nCarefully tilt the pan so the melted butter coats the bottom. Arrange all of the bread slices in a single layer in the melted butter on the baking sheet. Ensure the goat cheese is facing up.\n\n\nPlace 1 cheddar slice on each bread slice with goat cheese and place 1 slice each of provolone and 1 slice of Swiss on each plain bread slice.", "Bake:  \n\nReturn to the oven and bake at 425°F until the cheese is bubbly and the bread is beginning to brown, about 7 minutes.", "Assemble sandwiches and return to the oven:  \n\nRemove from the oven and assemble the sandwiches by combining each of the goat cheese slices with the provolone and Swiss slices. Return to oven and bake until bread is golden and toasted, 3 to 4 minutes.\n\n\nLove the recipe? Leave us stars below!"]}, {"title": "Carne Asada", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/recipes/carne_asada/", "image_url": "https://www.simplyrecipes.com/thmb/zkKrlKmy5a36cUeD1uhrV6-GKDo=/450x300/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2007__05__carne-asada-horiz-a-1400-f1b982e98a6b4a459bee8949b73f1ace.jpg", "ingredients": ["1/3 cup extra virgin olive oil", "1/4 cup soy sauce", "2 tablespoons lime juice", "2 tablespoons cider vinegar", "2 tablespoons sugar", "1 teaspoon ground black pepper", "1 teaspoon ground cumin", "4 cloves garlic", "1 pepper jalapeño chili", "1/2 cup fresh cilantro leaves and stems"], "instructions": ["Marinate the steak:  \n\nWhisk to combine the olive oil, soy sauce, lime juice, vinegar, sugar, black pepper, and cumin in a large, non-reactive bowl or baking dish. Stir in the minced garlic, jalapeño, and cilantro.\n\n\nPlace the steak in the marinade and turn over a couple of times to coat thoroughly.\n\n\nCover in plastic wrap and refrigerate for 1 to 4 hours or overnight (if using flank steak marinate at least 3 hours).", "Preheat the grill:  \n\nPreheat your grill for high direct heat, with part of the grill reserved with fewer coals (or gas flame) for low, indirect heat. You'll know the grill is hot enough when you can hold your hand above the grill grates for no more than one second.\n\n\n(You can also use a cast iron grill pan on high heat if cooking on the stovetop.)", "Sear the steak:  \n\nRemove the steak from the marinade. Lightly brush off most of the bits of cilantro and garlic (do not brush off the oil).\n\n\nPlace on the hot side of the grill. Grill the steak for a few minutes only, until well seared on one side (the browning and the searing makes for great flavor), then turn the steak over and sear on the other side.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer\n\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "Move the steak to the cool side of the grill:  \n\nOnce both sides are well seared, move the steak to the cool side of the grill, with any thicker end of the steak nearer to the hot side of the grill.\n\n\nTest with a meat thermometer into the thickest part of the steak, or use your fingers (see The Finger Test to Check the Doneness of Meat). Pull the meat off the grill at 115°F to 120°F for rare, 125°F medium rare, 140°F for medium. The meat will continue to cook in its residual heat.\n\n\nNote that lean flank steak is best cooked rare, while skirt steak can be cooked well without losing moisture or flavor because it has more fat marbling.", "Tent with foil and let rest:  \n\nPlace the steak on a cutting board, tent with foil, and let rest for 10 minutes.", "Slice the steak across the grain:  \n\nUse a sharp, long bladed knife (a bread knife works great for slicing meat) to cut the meat. Notice the direction of the grain of the meat and cut perpendicular to the grain. Angle your knife so that your slices are wide and thin.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "(Optional) Serve with grilled tortillas:  \n\nWarm the tortillas (corn or flour) for 30 seconds on each side in a dry skillet or on the grill, until toasty and pliable. Alternatively, you can warm tortillas in a microwave: heating just one or two at a time, place tortillas on a paper towel, and microwave them for 15 to 20 seconds each on high.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer\n\n\n\n(Optional) Serve with pico de gallo (fresh tomato salsa), chopped avocados, and other fixings."]}, {"title": "The 3-Ingredient Pizza Beans That Converted My Kids Into Bean Lovers", "time needed": null, "url": "https://www.simplyrecipes.com/3-ingredient-pizza-beans-recipe-7377878", "image_url": "https://www.simplyrecipes.com/thmb/wChCxFYOQXUE7QtcEHBwuFZd8Fk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Pizza-Beans-LEAD-02-6ef85a2a64ea45f9a6dba8ff805f43bf.jpg", "ingredients": null, "instructions": null}, {"title": "Skillet Cacio e Pepe Tortellini With Wilted Greens", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/skillet-cacio-e-pepe-tortellini-with-wilted-greens-recipe-7369113", "image_url": "https://www.simplyrecipes.com/thmb/5XgCiH-X_r356QeHrBlmMymQU7o=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Skillet-Cacio-e-Pepe-Tortellini-LEAD-2-1a81287e04004a53932c00e05da3df18.jpg", "ingredients": ["5 tablespoons olive oil", "20 ounce frozen cheese tortellini", "1 teaspoon kosher salt", "2 teaspoons ground black pepper", "1 1/2 cups water", "3 ounces baby kale", "1 cup grated Pecorino Romano cheese"], "instructions": ["Sear the tortellini:  \n\nHeat 3 tablespoons of olive oil in a 12-inch cast iron skillet over medium heat until shimmering. Add the tortellini in an even layer. Cook, tossing occasionally, until nicely browned in spots, 2 to 4 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the tortellini:  \n\nAdd the water, kosher salt, and black pepper. Stir with a wooden spoon to combine, scraping up browned bits from the bottom of the pan. Cover with a lid or baking sheet and cook, stirring and scraping up any browned bits from the bottom of the pan occasionally, until the pasta is tender and glossy and almost all of the water has evaporated, 3 to 5 minutes.\n\n\n\nSimple Tip!\n\nIf using a baking sheet as a lid, handle it with a potholder. It gets hot!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Stir in the greens and cheese, then serve:  \n\nRemove from the heat and stir in the greens, handfuls at a time, until just wilted, about 2 minutes. Stir in the grated cheese and the remaining 2 tablespoons of olive oil. Serve garnished with additional grated cheese and freshly ground black pepper.\n\n\nRefrigerate leftovers in an airtight container for up to 5 days.\n\n\nDid you love the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Chop Suey", "time needed": "35 mins", "url": "https://www.simplyrecipes.com/chop-suey-recipe-7229832", "image_url": "https://www.simplyrecipes.com/thmb/fW1przUKJOIuLvhzSToqUFdUEIc=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Chop-Suey-LEAD-01-bf724045c4c5454faa0b1fe02ef77391.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 pound boneless, skinless chicken thighs", "1/2 medium white onion", "2 carrots carrots", "1/3 cup low-sodium chicken broth", "2 tablespoons oyster sauce", "1 tablespoon soy sauce", "2 teaspoons sugar", "2 teaspoons sesame oil", "10 shiitake mushrooms shiitake mushrooms", "1 red bell pepper red bell pepper", "2 ribs celery ribs celery", "4 ounces snow peas", "2 green onions green onions", "3 ounces mung bean sprouts", "1 1/2 teaspoons cornstarch", "1 1/2 teaspoons water", "Salt Salt Salt", "3 cups steamed rice"], "instructions": ["Cook the chicken:  \n\nAdd the oil to a wok or a large, deep non-stick skillet over medium-high heat. Heat the oil just until it starts to smoke, about 1 minute.\n\n\nAdd the chicken thighs. Stir fry until the chicken is no longer pink, about 5 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Add the onion, carrots, and seasonings:  \n\nAdd the onion, carrots, chicken broth, oyster sauce, soy sauce, sugar, and sesame oil. Stir fry over high heat for 5 minutes. The sauce should be bubbling.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Add the mushrooms, pepper, and celery:  \n\nAdd mushrooms, bell pepper, and celery. Stir fry until the celery has softened to crisp-tender, about 5 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Add the peas, green onions, and bean sprouts:  \n\nAdd the peas, green onions, and bean sprouts. Stir fry until well-mixed and heated through, about 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Thicken the sauce:  \n\nAdd the cornstarch and water to a small bowl and stir to dissolve. Add the cornstarch slurry to the pan and stir fry until the sauce has thickened to your liking, 1 to 2 minutes. Taste and add salt, if needed. Serve with rice.\n\n\nLove the recipe? Leave us stars and a review below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu"]}, {"title": "Daal Palak (Lentil & Spinach Curry)", "time needed": "50 mins", "url": "https://www.simplyrecipes.com/daal-palak-lentil-and-spinach-curry-7112108", "image_url": "https://www.simplyrecipes.com/thmb/HRp_VWxwt_VjJHIh--WLDEqg9_o=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Daal-Palak-Recipe-Lead-01-bd527b38eaf34ee9939ab697d76e0613.jpg", "ingredients": ["1 red onion red onion", "1/2 lime Juice", "1/4 teaspoon salt"], "instructions": ["Make the pickled onions:  \n\nIn a small bowl add the sliced onions, lime juice and salt. Using your hands, mix it well and let it marinate for 30 minutes while you make the rest of the recipe.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Cook the lentils:  \n\nIn a medium stock pot add the lentils and 3 cups of room temperature water. Bring to a boil over high heat.\n\n\nSkim and discard foam that may gather on the top. Reduce the heat and simmer uncovered until soft, approximately 20-30 minutes. Add more water if you need to, and stir the pot if you’re worried the lentils are sticking to the bottom of the pot as they get softer (I usually don’t find this necessary).\n\n\n\nSimple Tip!\n\nIf we start cooking lentils in cold water it doesn’t cook them all the way through, leaving a little grainy texture on the palette. I always start with room temperature water.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Add the spices to the lentils:  \n\nOnce the lentils are cooked through, add the ginger garlic paste and turmeric and stir. Cook for 1 minute on low heat.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Add the spinach:  \n\nAdd the spinach and cilantro and cook for 3-5 minutes on low heat until the spinach wilts and the daal is thicker.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Season:  \n\nTake the pot off the heat and season with salt and lime juice.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Make the tadka:   \n\nIn a small sauté pan over low to medium low heat, add the ghee, cumin seeds, and red chiles. \n\n\nOnce it is sizzling, add the Kashmiri chili powder and ground cumin and stir briefly.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Add tadka to the daal:  \n\nPour a little more than half the tadka into the pot with the daal, reserving the rest to be spooned over after serving.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker", "Serve:  \n\nDivide the daal palak between serving bowls (over rice, if you'd like). Top with the pickled onions, papad, yogurt, and add more tadka if you want more heat. \n\n\nStore the leftovers in an airtight container in the fridge for up to 4 days. Keep the leftover pickled onions on their own in a glass jar in the fridge for 1 day.\n\n\nDid you love the recipe? Leave us stars below.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Annika Panikker"]}, {"title": "Microwave Broccoli with Sesame Dressing", "time needed": "15 mins", "url": "https://www.simplyrecipes.com/microwave-broccoli-with-sesame-dressing-recipe-7110085", "image_url": "https://www.simplyrecipes.com/thmb/NBReEdCMRlZX6-_BsZDmP7zhUpg=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Microwave-Broccoli-with-Sesame-LEAD-7-85751163ae514ee4a1ba47e4ef32aeac.jpg", "ingredients": ["1/4 cup olive oil", "2 cloves garlic cloves garlic", "1 teaspoon ginger", "1 tablespoon apple cider vinegar", "1 tablespoon soy sauce", "2 teaspoons toasted sesame oil", "2 teaspoons toasted sesame seeds", "1/4 teaspoon kosher salt", "1/4 teaspoon crushed red pepper flakes", "6 cups broccoli florets", "3/4 cup water"], "instructions": ["Make the sesame dressing:   \n\nPour the oil into a small microwave-safe bowl or glass measuring cup. Cover it tightly with plastic wrap and use a paring knife to poke a hole in plastic wrap so steam can escape. Microwave on high until the oil is very hot, about 3 minutes. \n\n\nCarefully remove and discard plastic wrap. Stir in the grated garlic and ginger (you should hear sizzling), and let it stand for 5 minutes. You can cook the broccoli in the meantime. \n\n\nWhisk in the vinegar, soy sauce, sesame oil, sesame seeds, salt, and crushed red pepper flakes, if using.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mihaela Kozaric Sebrek\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mihaela Kozaric Sebrek", "Cook the broccoli:   \n\nPlace the broccoli florets in a large microwave-safe bowl (we used a 8-cup glass measuring cup) and pour 3/4 cup water over the broccoli. Cover the bowl tightly with plastic wrap, and microwave on high until broccoli is tender-crisp, 5 to 7 minutes, stirring halfway through and re-covering the bowl. \n\n\nCarefully remove the plastic wrap and drain the broccoli into a colander set in the sink, and transfer it back into the bowl.\n\n\n\nSimple Tip!\n\nWe developed and tested the recipe using a 1,200-watt microwave. Depending on the power of your microwave, you may need to cook the broccoli for longer, adding more time in 1-minute intervals. Look for visual cues—the broccoli is ready when it’s bright green, and tender, but not mushy.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mihaela Kozaric Sebrek", "Toss and serve:   \n\nPour the prepared dressing over the cooked broccoli and toss to evenly coat. Garnish with more sesame seeds. Serve immediately or let it stand at room temperature for 20 minutes to let flavors meld. \n\n\nDid you love the recipe? Leave us a rating below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mihaela Kozaric Sebrek\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mihaela Kozaric Sebrek"]}, {"title": "Microwave Shakshuka", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/microwave-shakshuka-recipe-7111138", "image_url": "https://www.simplyrecipes.com/thmb/fTm4tquEYxdubXTs4__aGG5UPfo=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipe-Microwave-Shakshuka-LEAD-4-ad7332bf30c04bbbb9a9c75f8d0a2153.jpg", "ingredients": ["3 cups red bell peppers", "2 cups yellow onion", "1/4 cup water", "15 ounce can crushed tomatoes", "2 tablespoons extra-virgin olive oil", "2 clove garlic clove garlic", "1/2 teaspoon paprika", "1/2 teaspoon ground cumin", "1/2 teaspoon ground coriander", "1/8 teaspoon ground cinnamon", "1/8 teaspoon cayenne pepper", "3/4  kosher salt", "4 large eggs large eggs", "cilantro leaves cilantro leaves cilantro leaves"], "instructions": ["Cook the vegetables:   \n\nPlace the bell peppers, onions, and 1/4 cup water in a 9 1/2-inch deep-dish microwave-safe glass pie plate. Cover tightly with plastic wrap and microwave on high until the vegetables are tender-crisp, about 8 minutes, stirring once halfway through and re-covering with plastic wrap. \n\n\nCarefully hold the bell pepper mixture back with a spatula or slotted spoon and pour out water into the sink.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Add the tomatoes and seasonings:   \n\nStir in the crushed tomatoes, olive oil, garlic, paprika, ground cumin, coriander, cinnamon, cayenne pepper, and 3/4 teaspoon of the salt to drained bell pepper mixture.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the shakshuka:   \n\nCover tightly with plastic wrap (you can reuse the same one or if you prefer, use a large plate) and use the tip of a paring knife to poke a small hole in the center of the plastic wrap to let steam escape. \n\n\nMicrowave on high until the sauce is bubbly and hot, about 8 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the eggs:   \n\nUse the back of a large spoon to make 4 deep wells in the tomato mixture. Crack 1 egg into each well. Cover tightly with plastic wrap and microwave on high until the egg whites are just set but the yolks remain runny, about 2 minutes and 30 seconds. \n\n\nWe developed and tested the recipe in a 1,000 and 1,250-watt microwave. You may need to cook the eggs for longer, in 30-second intervals, depending on the power of your microwave. Look for visual cues: if whites look undercooked, keep cooking them until they are just set and yolks are runny.\n\n\nSeason the eggs with a pinch of salt and drizzle with additional olive oil. Garnish with cilantro and serve. \n\n\nDid you love the recipe? Leave us stars below.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Microwave Red Curry Poached Salmon", "time needed": "24 mins", "url": "https://www.simplyrecipes.com/microwave-red-curry-poached-salmon-recipe-7111220", "image_url": "https://www.simplyrecipes.com/thmb/CBuQ4LzhjtfA3m1D3Sy8D0DLHUQ=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/-Recipes-Microwave-Coconut-Salmon-LEAD-05-2-771aa0a074f741a7a7e5d5d6419d2c21.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 shallot shallot", "2 tablespoons cilantro leaves", "1 jalapeño pepper jalapeño pepper", "1 lemongrass lemongrass", "1 1-inch) piece fresh ginger", "14 ounce coconut milk", "1 tablespoon red curry paste", "2 teaspoons light brown sugar", "3/4 teaspoon kosher salt", "1 tablespoon lime juice", "4 ounce salmon filets", "Cooked rice Cooked rice Cooked rice"], "instructions": ["Make the aromatic oil:   \n\nProcess the oil, shallots, cilantro, jalapeño, lemongrass, and ginger in a mini food processor until very finely chopped, about 30 seconds, stopping to scrape down sides as needed. \n\n\nDon’t have a mini food processor? Very finely chop the shallots, cilantro, jalapeño, lemongrass, and ginger, and then stir in the oil. (You can do this directly in the pie plate—more on that below.)\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar", "Cook the mixture:   \n\nSpoon the mixture into a 9 1/2-inch microwave-safe glass pie plate. Microwave, uncovered, on high until it sizzles and is fragrant, 3 to 4 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar", "Add the coconut milk and curry paste:   \n\nStir in the coconut milk, curry paste, brown sugar, and 1/2 teaspoon salt until combined. Microwave, uncovered, on high until the coconut milk mixture is simmering and the flavors meld, 3 to 4 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar", "Cook the salmon:   \n\nStir in the lime juice and place the salmon filets, evenly spaced apart, in coconut milk mixture. Sprinkle the remaining 1/4 teaspoon salt on the salmon. Cover tightly with plastic wrap and microwave on medium (50% power) until the salmon is cooked to your desired degree of doneness, about 6 minutes. \n\n\nWe developed and tested the recipe in a 1,000 and 1,250-watt microwave. You may need to cook the salmon for longer, in 1-minute intervals, depending on the power of your microwave and how you like your salmon cooked.\n\n\nGarnish with cilantro and serve scooped over cooked rice. \n\n\nDid you love the recipe? Leave us a comment below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Tara Omidvar"]}, {"title": "Grilled Pork Tenderloin with Orange Marmalade Glaze", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/recipes/grilled_pork_tenderloin_with_orange_marmalade_glaze/", "image_url": "https://www.simplyrecipes.com/thmb/M60f52nTfeknJYeQbcyAzg-TJ00=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2007__05__grilled-pork-tenderloin-orange-marmalade-horiz-a-1200-68d9bee384d142f99c110aebe0ca0b1e.jpg", "ingredients": ["1/3 cup soy sauce", "1/3 cup orange marmalade", "1/3 cup honey", "1 tablepoon rice wine vinegar", " Pinch crushed red pepper flakes", "1 pound pork tenderloin", "2  scallions", "  Olive oil"], "instructions": ["Make marinade:  \n\nIn a small saucepan, bring the soy sauce, marmalade, honey, rice wine vinegar, and red pepper flakes to a simmer over medium heat. Remove from the flame and let cool.\n\n\nReserve half of the marinade for serving as a sauce with the finished tenderloin.", "Marinated the tenderloin:  \n\nWith the remaining half of the marinade, marinate the tenderloin for 1 hour.", "Prepare the grill:  \n\nWhile the tenderloin is marinating, prepare your grill for high direct heat on one side, and a low heat on the other side.", "Sear tenderloin on all sides:  \n\nRemove the tenderloin from the marinade and coat with olive oil. Place on the hot side of the grill, with the narrower end of the tenderloin more toward the cool side of the grill.\n\n\nAs soon as the tenderloin gets grill marks on one side (a minute or two), turn it to get grill marks on another side. Continue until all sides are lightly seared.", "Finish on cool side of the grill:  \n\nMove the tenderloin to the cool side of the grill. Cover and cook a few minutes more, until the internal temperature of the tenderloin reaches 140°F (no higher). Remove from heat.\n\n\nSafe Pork Temperature: What's the Temperature of Cooked Pork?\n\nREAD MORE:", "Tent with foil and let rest:  \n\nIf you have let the temp get too high above 140°F, you may need to slice the pork immediately or the meat will continue to cook as it rests and become overcooked.\n\n\nIf you have taken it out in time, tent the tenderloin with foil and let it rest 10 minutes.\n\n\nThinly slice, sprinkle with the remaining glaze and scallions.\n\n\nServe with rice."]}, {"title": "Microwave Sweet Potato", "time needed": "10 mins", "url": "https://www.simplyrecipes.com/microwave-sweet-potato-recipe-7095968", "image_url": "https://www.simplyrecipes.com/thmb/cgRvRIu9rpFalxJUJeT-a6oX4Co=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Microwave-Sweet-Potato-LEAD-1-5d8be9e95deb4c348eb5d627f57e21b2.jpg", "ingredients": ["10 ounces sweet potato", "1/2 teaspoon canola oi", "1/4 teaspoon kosher salt"], "instructions": ["Prepare the sweet potato:  \n\nIf you’d like to crisp the skin on your sweet potato, preheat the oven to 425°F.\n\n\nGive the sweet potato a wash, but don’t dry it off. The residual moisture will help keep the sweet potato moist.\n\n\nUse a fork to prick the sweet potato 4 to 5 times all over.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Wrap the sweet potato:  \n\nMoisten a paper towel with water and wring it out. Use it to tightly wrap the sweet potato and place it on a microwave-safe plate.\n\n\nAlternatively, you can add the sweet potato to a microwave-safe lidded container. Add the lid, leaving it just barely cracked.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Microwave:  \n\nPlace the plate in the microwave and cook on high power for 5 minutes. When done, you’ll be able to easily pierce the sweet potato all the way to the center with a fork or all the way through with a paring knife. If your sweet potato is not quite tender enough, re-wrap it and microwave it for another minute.\n\n\n\nSimple Tip!\n\nTo cook 2 or 3 sweet potatoes at once, you’ll need to up the cook time by about 2 minutes for 2 potatoes (7 minutes total), and 3 minutes for 3 potatoes (8 minutes total).\n\n\nOnce you’ve figured out what size potato and what timing works with your microwave, make a note and do it every time for the best results.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Crisp the skin (optional):  \n\nFor lightly crispy skin, unwrap the sweet potato, place it on a small baking sheet, and brush all over with oil. Sprinkle with salt, if desired. Bake at 425°F for 10 minutes.\n\n\n\nSimple Tip!\n\nIf you have an air fryer, crisp the skin in an air fryer at 425°F for about 5 minutes.\n\n\nRefrigerate leftovers in an airtight container for up to 3 days.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel"]}, {"title": "Garam Masala Fish Sticks", "time needed": "27 mins", "url": "https://www.simplyrecipes.com/garam-masala-fish-sticks-recipe-7094148", "image_url": "https://www.simplyrecipes.com/thmb/vHLksmpQercRi3RjHXpyEngIXB8=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Garam-Masala-Fish-Sticks-LEAD-5-e87828b2b71d4e9cb94ce56f336923f8.jpg", "ingredients": ["Cooking spr ay", "1 pound cod fish fillets", "1 teaspoon kosher salt", "1/4 cup all-purpose flour", "1 teaspoon garam masala", "1/2 teaspoon cayenne pepper", "ground black pepper ground black pepper ground black pepper", "1 large egg large egg", "1/3 cup whole milk", "3/4 cup panko breadcrumbs"], "instructions": ["Preheat the oven to 450°F.  \n\nLine a baking sheet with parchment paper or a silicone baking mat and spray with cooking spray and set aside.", "Prepare the fish:  \n\nUsing paper towels, pat the fish dry on both sides.\n\n\nCut the fish fillet into 3/4-inch wide, finger-length pieces. Sprinkle the fish sticks with salt.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Make a dredging station:  \n\nIn a medium bowl, combine the flour, garam masala, and cayenne powder and season with salt and pepper. In another medium bowl, whisk together the egg and milk and season lightly with salt. In a third medium bowl, add the panko and season with salt and pepper.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Dredge the fish sticks:  \n\nWorking with one fish stick at a time, dip it into the flour mixture, ensuring it is coated evenly. Dip in egg wash next, letting any excess briefly drip off, then coat in the panko. Place on the prepared baking sheet.\n\n\nRepeat with the remaining fish sticks and make sure all sides of the fish sticks are well coated.", "Bake the fish sticks:   \n\nSpread the fish sticks out on the baking sheet in a single layer. Spray the tops with cooking spray.\n\n\nBake the fish sticks until they are cooked through and crispy on the outside, 12 to 15 minutes, flipping halfway through baking. They will not be especially brown.\n\n\nSprinkle the fish sticks with salt. Serve them warm with a dipping sauce of your choice.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh"]}, {"title": "Sweet and Sour Cabbage Soup", "time needed": "50 mins", "url": "https://www.simplyrecipes.com/sweet-and-sour-cabbage-soup-recipe-6835442", "image_url": "https://www.simplyrecipes.com/thmb/QStYIBRiBHbko90ky4JzIUXfUV4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Sweet-Sour-Cabbage-LEAD-01-69cfc6504cc24de2a79a1ce7af36ee95.jpg", "ingredients": ["2 tablespoons olive oil", "1 medium yellow onion", "2 cloves garlic cloves garlic", "2 tablespoons tomato paste", "1 tablespoon paprika", "2 pounds green cabbage", "3 carrots carrots", "1 bay leaf bay leaf", "8 cups low-sodium", "28- ounce can crushed tomatoes", "1/4 cup apple cider vinegar", "2 tablespoons brown sugar", "2 tablespoons lemon juice", "Salt and pepper Salt and pepper Salt and pepper", "1/4 cup chopped fresh parsley"], "instructions": ["Sauté the onion, garlic, tomato paste, and paprika:  \n\nHeat the oil in a large, heavy-bottomed pot (about 4 to 5 quarts) over medium heat. Add the onion and sauté until it softens slightly, about 3 minutes. Add the garlic, tomato paste, and paprika and stir. Cook for another minute.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Micah Siva", "Add the soup ingredients:  \n\nAdd the cabbage, carrots, and bay leaf to the pot. Pour the broth, crushed tomatoes, vinegar, and brown sugar over the cabbage. Stir to combine. \n\n\nBring to a boil and adjust the heat to a simmer. Cover with a lid and simmer until the cabbage is fully cooked and tender, 25 to 30 minutes. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Micah Siva\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Micah Siva", "Finish and serve:  \n\nAdd the lemon juice and season with salt and pepper to taste. Add more sugar or seasoning as needed.\n\n\nServe topped with fresh parsley and freshly ground pepper.\n\n\nStore any leftovers in an airtight container in the fridge for up to 5 days.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Micah Siva\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Micah Siva"]}, {"title": "Taquitos de Pollo (Chicken Taquitos)", "time needed": "60 mins", "url": "https://www.simplyrecipes.com/taquitos-de-pollo-chicken-taquitos-recipe-6832577", "image_url": "https://www.simplyrecipes.com/thmb/rTpZAoTi9naDDwoDhwAXcCPXJ5Q=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Tacquitos-de-Pollo-LEAD-7-2-fea2664d792c4c3d8615d1b7648aef02.jpg", "ingredients": ["24 corn tortillas", "1 1/4 pounds shredded chicken", "1 quart vegetable oil"], "instructions": ["Heat the tortillas:  \n\nWrap the tortillas in a clean dish towel and place them in the microwave to steam, making them pliable. Use medium to high heat for increments of 30 seconds until they are just warmed through. Do not overheat, or they will be too fragile to use.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Fill the tortillas:  \n\nPlace 2 dinner plates on the counter. One is a work surface, and the other is for the rolled taquitos. \n\n\nUsing a dinner plate as a work surface, place a warmed tortilla in the center and add about 2 tablespoons of shredded chicken towards the right of the center in an even line. Do not overfill. Roll up tightly without splitting the tortilla. \n\n\nEither place the taquito seam-side down on the plate or secure the tortilla by threading a toothpick through the seam of the taquito like pinning a diaper. Repeat with the remaining tortillas and chicken. \n\n\n\nSimple Tip!\n\nIf not frying right away, cover with a damp kitchen towel and place in the fridge.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Fry the taquitos:  \n\nAdd 1/2 inch of canola oil to a 12-inch cast iron frying pan over medium heat. Use an instant-read thermometer to check the temperature—it should be 350°F. Line a baking sheet or platter with paper towels.\n\n\nOnce the oil is hot, place 5 to 6 taquitos seam-side down in the frying pan with tongs so you don't burn your fingers. Make sure not to crowd the pan or the taquitos will not get golden brown.\n\n\nOnce you see the edges turning golden, about 3 to 4 minutes per side, turn over with tongs and fry until the other side is cooked to the same color.\n\n\nRemove from the pan with tongs and place on the baking sheet or platter to drain. Add more oil to bring it back up to 1/2 inch up the pan and let the oil come to temperature in between batches, if needed. Repeat with the remaining taquitos.\n\n\n\nSimple Tip!\n\nIf you are frying a bunch, place the finished taquitos on a cookie sheet in the oven at 325°F to keep warm until serving.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Serve with toppings:  \n\nRemove the toothpicks. Add toppings like chopped onion, cilantro, lettuce, crema, crumbled queso fresco, and salsa. Serve hot.\n\n\nExtra taquitos (without toppings) can be stored in a zip-top freezer bag in the freezer for up to 4 months or in an airtight container in the fridge for 2 days. \n\n\nWhile you can eat them cold out of the fridge—and I have—they reheat nicely on a cookie sheet in the oven at 400°F for about 5 minutes or until you can see the surface sizzle. If pulling them from the freezer, reduce the temperature to 350°F and increase the time to 10 to 15 minutes. \n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel"]}, {"title": "Kai Jeow (Thai Omelet)", "time needed": "10 mins", "url": "https://www.simplyrecipes.com/kai-jeow-thai-omelet-recipe-6831375", "image_url": "https://www.simplyrecipes.com/thmb/45vF7t6vRNnKx3YwinQUu8kYkyM=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Thai-Omelette-LEAD-6-666cd80a07b745ca861e6c0998381b8b.jpg", "ingredients": ["3 large eggs large eggs", "2 teaspoons fish sauce", "1/4 teaspoon brown sugar", "1 scallion scallion", "1/2 Thai chili Thai chili", "1/4 teaspoon black pepper", "3 tablespoons vegetable oil"], "instructions": ["Whisk the eggs:  \n\nIn a medium bowl, combine the eggs, fish sauce, brown sugar, scallion, Thai chili (if using) and black pepper in a medium bowl. Whisk vigorously until well combined and no egg whites are visible.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Heat the oil smoking hot:  \n\nHeat vegetable oil in a small (about 8-inch diameter) nonstick skillet over medium-high heat until the oil is hot. You will know when the oil is ready when it smokes lightly.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Pour the eggs into the hot skillet and cook:  \n\nHold the bowl of egg mixture 12 inches above the skillet and pour it into the skillet. \n\n\nThe egg will immediately start to fry and become puffy. Cook until lightly browned on the bottom. While you wait, use a small spatula or chopsticks to push the edges of the omelet inward and tilt the pan to encourage the raw eggs in the center to come in contact with the pan. Cook the first side for approximately 3 minutes. \n\n\nOnce the omelet is firm, flip the omelet by either flicking your wrist to flip the omelet like a pancake or use a large spatula. Allow it to cook until the other side is browned, approximately 15 seconds.\n\n\n\nSimple Tip!\n\nHere’s another flipping trick. Use a plate or the bottom of a large lid as a flipping aid. Slide the omelet from the pan onto the plate or lid so that the uncooked side is still up, then flip it over into the pan so the cooked side faces up.\n\n\nDon’t worry if the omelet does not flip perfectly. It’ll still taste just as good.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Serve:  \n\nServe immediately with cooked rice, cucumber slices, romaine lettuce, and sriracha (if using). You can create a lettuce wrap with the romaine lettuce if you’d like. In the wrap, you can add cucumber, omelet, and rice. \n\n\nDid you love this recipe?  Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Lemon Pepper Chicken Breasts", "time needed": "27 mins", "url": "https://www.simplyrecipes.com/lemon-pepper-chicken-breasts-recipe-6828643", "image_url": "https://www.simplyrecipes.com/thmb/3m06sZ93moYOMJapnRrSvfQltlA=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Lemon-Pepper-Chicken-LEAD-1-2ad0b52ee31a427fb2c635c350f36787.jpg", "ingredients": ["1 3/4 pounds chicken breasts", "1 1/2 tablespoons lemon pepper seasoning", "1/2 teaspoon kosher salt", "3/4 cup all-purpose flour", "1 1/2 tablespoons vegetable oil", "4 tablespoons unsalted butter", "2 cloves garlic cloves garlic", "1/2 cup chicken stock", "1/3 cup lemon juice", "1/4 cup Italian parsley", "Lemon slices Lemon slices Lemon slices"], "instructions": ["Cut the chicken breast into cutlets:   \n\nPlace the palm of your hand flat against the top of a whole chicken breast to keep it from sliding around. With the broad side of your knife horizontal to the cutting board, cut through the chicken breast to create 2 thinner halves (cutlets).\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz", "Season, then dredge the chicken breasts:   \n\nIn a small bowl, combine 4 teaspoons of the lemon pepper seasoning and the salt. Add the flour to a separate shallow dish. \n\n\nSeason both sides of each of the chicken breasts with the spice mixture. Dredge both sides of the seasoned chicken in the flour, shaking off any excess flour, then lay the dredged chicken on a wire rack or platter while you heat the pan.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz", "Pan-fry the chicken:  \n\nIn a large skillet, heat the oil and 2 tablespoons of the butter over medium heat. Once the butter is melted, swirl the pan a little to combine the two fats. Once the oil in the skillet begins to shimmer, lay your chicken cutlets in a single layer in the pan. You may need to fry in batches.\n\n\nFry the chicken for 3 minutes without moving. Use a pair of tongs to flip the chicken and fry until they’re cooked through, an additional 2 1/2 to 3 minutes. \n\n\nUse your tongs to remove the chicken from the skillet to a platter.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz", "Make the lemon pepper sauce:    \n\nDiscard the darkened fat from the skillet. Return the skillet to the stove and add the remaining butter. \n\n\nMelt the butter in the pan over medium heat. Once the butter has melted, add the garlic. Sauté the garlic in the butter until fragrant, 30 to 45 seconds.\n\n\nAdd the chicken stock and lemon juice and deglaze the pan, scraping up any browned bits from the bottom of the pan. Allow the liquid in the skillet to come to a boil and continue to boil until very slightly thickened, about 1 minute. Season the sauce with the remaining 1/2 teaspoon of lemon pepper seasoning and salt to taste.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz", "Coat the chicken:   \n\nOnce the sauce has reduced slightly, return the chicken breasts to the pan. Turn them over to coat both sides in the sauce and turn the stove off. Allow the residual heat from the pan to warm the chicken up before sprinkling the chopped parsley over top. \n\n\nGarnish with lemon slices and serve. \n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Marta Rivera Diaz"]}, {"title": "Stir-Fried Maitake Mushrooms with Garlic and Chile Oil", "time needed": "13 mins", "url": "https://www.simplyrecipes.com/stir-fried-maitake-mushrooms-with-garlic-and-chile-oil-recipe-6828271", "image_url": "https://www.simplyrecipes.com/thmb/aEBiOv4NBT3mOAW8keeT_G6bKxA=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Mushroom-Garlic-Chile-LEAD-12-02e8072b3c7c4f1690d75f39bf1dd175.jpg", "ingredients": ["1 tablespoon light soy sauce", "2 tablespoons water", "3 tablespoons vegetable oil", "1/4 cup garlic", "12 ounces maitake mushrooms", "2 teaspoons chile oil"], "instructions": ["Prep the ingredients:   \n\nPlace the soy sauce in a small bowl. Place the water in a separate small bowl and set both aside.", "Cook the garlic:  \n\nHeat the oil in a wok (or a large skillet) over high heat until it shimmers. Add the garlic, and cook, stirring frequently with a wok shovel or a wooden spoon, until it is golden and just beginning to turn light brown, about 1 minute. \n\n\nUse a slotted spoon (or just your stirring spoon) to remove the garlic from the pan, leaving the oil. Set the garlic aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Cook the mushrooms:  \n\nAdd the mushrooms to the oil and stir-fry them—flipping and stirring occasionally and pressing them against the sides of the wok for 20 to 30 seconds at a time, so they brown a bit—for 3 minutes total. \n\n\nIf the mushrooms are browning quickly but are not beginning to wilt, drizzle in the water, to help them soften.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Add soy sauce to the mushrooms:   \n\nDrizzle the soy sauce over the mushrooms, then continue to cook them for another 2 minutes, until the liquid is fully absorbed, and the mushrooms look soft and tender.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Add the chile oil:  \n\nDrizzle in the chile oil and mix everything well. \n\n\n\nSimple Tip!\n\nStart with the lower amount if you’re worried about the spice level, then taste and add more as desired. If you really like garlic, add about half of the cooked garlic back into the pan (but do so judiciously!)\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Serve:  \n\nTransfer the mushrooms to a serving bowl, and enjoy while hot with rice and other Chinese dishes.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu"]}, {"title": "Chopped Cheese", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/chopped-cheese-recipe-6825969", "image_url": "https://www.simplyrecipes.com/thmb/sfqi78rKj2qtE-DObQ5CS70Um5E=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Chopped-Cheese-LEAD-02-b880580380654b0392c8d112c0ed5ec2.jpg", "ingredients": ["2 pounds ground beef", "1 white onion white onion", "4 clove garlic clove garlic", "1 teaspoon kosher salt", "1/2 teaspoon black pepper", "1 tablespoon Worcestershire sauce", "6 hoagie hoagie", "12 slices American cheese", "6 tablespoons mayonnaise", "iceberg lettuce iceberg lettuce iceberg lettuce", "Tomato slices Tomato slices Tomato slices"], "instructions": ["Cook the ground beef:  \n\nAdd your ground beef to a large, dry pot or skillet over medium-low heat. Slowly cook so the fat renders out. Stir regularly, breaking up the beef as it cooks, until it is in crumbles but not fully cooked (some of the meat will still be pink).  \n\n\n\nSimple Tip!\n\nIf you want to be authentic, you can use the side of a metal spatula to “chop” the beef as it cooks, but a spoon will work, too.", "Add the onions, garlic, and seasoning:  \n\nOnce the beef is browned and most of the fat has rendered out (about 7-8 minutes of cooking), turn the heat up to medium and add onions and garlic. Cook for another 4-5 minutes until vegetables soften. Season the filling with salt, pepper, and Worcestershire sauce. Remove from heat.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Toast the buns:   \n\nSlice your rolls in half and toast them in batches over a griddle or in a large skillet over medium heat until browned.", "Combine the cheese and ground beef:   \n\nFor each sandwich, portion out about 1/6 of the beef filling at a time and add to the griddle or skillet over medium-low heat. Let the filling get hot and then cover it with two slices of American cheese. Let it sit long enough got the cheese to melt. If you like, roughly “chop” the cheese into the beef mixture with the side of a metal spatula.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Place the roll on the ground beef:  \n\nAdd 1 tablespoon of mayo to one side of your toasted roll and cover the beef filling with a toasted roll, by placing the roll, toasted side down, on top of the chopped beef mixture.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Finish the sandwich and serve:   \n\nAfter 30 seconds, use a spatula to flip the roll, keeping the filling inside. If any filling falls out, use the spatula to add it back to the roll. Repeat as needed to make other sandwiches.\n\n\nAdd shredded lettuce and sliced tomato to the sandwich. Cut in half and serve immediately. \n\n\nLeftover chopped cheese filling can be stored in the fridge in an airtight container for 3-4 days. You can add the filling straight from the fridge to a griddle to make a sandwich. \n\n\nOnly make as many sandwiches as you need to, but if you have leftover filling, that’s great! \n\n\nAny chopped cheese fans out there? Leave a comment!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "Instant Pot Eggplant Chickpea Stew", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/instant-pot-eggplant-chickpea-stew-recipe-6751097", "image_url": "https://www.simplyrecipes.com/thmb/3lNoEihZ0QGe7QPpT3-H1X-P1A8=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Eggplant-Chickpea-Stew-LEAD-02-dea20a30a9824f0e86c6d072d665196f.jpg", "ingredients": ["1 large eggplant large eggplant", "1 red bell pepper red bell pepper", "1 teaspoon kosher salt", "2 tablespoons extra-virgin olive oil", "2 garlic cloves garlic cloves", "1/2 medium yellow onion", "15 ounce chickpeas", "2 tablespoons fresh mint", "1 teaspoon dried oregano", "1/4 teaspoon ground cumin", "1/4 cup water", "2 tablespoons tomato paste"], "instructions": ["Salt the vegetables:  \n\nIn a mixing bowl, toss the eggplant and bell pepper with the salt. Let sit for 15 minutes.\n\n\n\nSimple Tip!\n\nAs the salted vegetables sit, prep the other ingredients.", "Saute the garlic and onion:  \n\nSelect the SAUTÉ setting on the Instant Pot and heat the olive oil and garlic. When the garlic begins to bubble, add the onion and sauté for about 2 more minutes, until just softened.", "Add the salted vegetables, chickpeas, seasonings, and water:  \n\nAdd the eggplant and bell pepper, chickpeas, mint, oregano, cumin, and water and stir to combine. Dollop the tomato paste on top, but do not stir.\n\n\n\nSimple Tip!\n\nAdding the tomato paste on top of the other ingredients keeps the burn warning from coming on.", "Pressure cook the stew:  \n\nSecure the lid and set the pressure release to Sealing. Press the Cancel button to reset the cooking program, then select the PRESSURE COOK or MANUAL setting for 3 minutes at high pressure. (The pot will take about 5 minutes to come up to pressure before the cooking program begins.)", "Release the pressure:  \n\nWhen the cooking program ends, perform a quick pressure release by moving the pressure release to Venting, or let the pressure release naturally. Open the pot, then stir in the tomato paste.", "Serve:   \n\nSpoon the stew onto plates or serving bowls. Top with the crumbled feta and serve right away, with rice alongside.\n\n\n\nSimple Tip!\n\nLeftovers will keep in an airtight container for 3-4 days.\n\n\nDid you love the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nDana Gallagher / The Instant Kitchen Cookbook by Coco Morante"]}, {"title": "Shrimp and Mushroom Stir Fry", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/shrimp-and-mushroom-stir-fry-recipe-6740223", "image_url": "https://www.simplyrecipes.com/thmb/upy6KP6u2Ohoi-L4oTC1f1Qxamc=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Shrimp-Mushroom-Stir-Fry-LEAD-04-22684f35becf4185ac536b3d10ec6368.jpg", "ingredients": ["12 ounces cremini mushrooms", "1 pound large shrimp", "2 tablespoons olive oil", "3 scallions scallions"], "instructions": ["Make the stir fry sauce:   \n\nWhisk together the chicken stock, garlic, soy sauce, and cornstarch in a small bowl. Set aside.\n\n\n\nSimple Tip!\n\nWhisk again right before adding to the skillet to ensure the corn starch is not settled on the bottom.  \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Cook the mushrooms:   \n\nIn a large skillet or wok over medium heat, add olive oil and mushrooms. Cook until the mushrooms soften and turn brown in spots around the edges, about 8 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Add the shrimp:   \n\nOnce the mushrooms are cooked to your liking, add the shrimp to the skillet. If the skillet is very dry, add a fresh drizzle of oil to it to ensure the shrimp doesn’t stick. Cook, stirring constantly, until shrimp are cooked through and no longer translucent, 2-3 minutes.  \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Finish the stir fry:   \n\nOnce shrimp are cooked, add all the stir fry sauce to the skillet and stir to combine. The finished sauce should just coat the stir fry ingredients, almost like a thin gravy. If the sauce thickens too much, stir in extra water by the tablespoon. If the sauce is too thin, let it simmer for 1-2 minutes and it will thicken. Lastly, stir in the chopped scallions.  \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Serve:  \n\nServe the shrimp stir fry spooned over cooked white rice garnished with sesame seeds.\n\n\nDid you love the recipe? Leave us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "Creamy Miso Mushroom Pasta", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/creamy-miso-mushroom-pasta-recipe-6544048", "image_url": "https://www.simplyrecipes.com/thmb/AdJ6irJsooor9DCqfK0_Jg4YpGg=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Miso-Mushroom-Pasta-LEAD-02-eb25e9edacd349219dee67933d82cc96.jpg", "ingredients": ["1 pound spaghetti", "Salt Salt Salt", "1 tablespoon olive oil", "6 ounces cremini mushrooms", "4 tablespoons unsalted butter", "2 cloves garlic cloves garlic", "1/3 cup grated Parmesan cheese", "2 tablespoons miso paste", "Fresh sage Fresh sage Fresh sage"], "instructions": ["Cook the pasta:  \n\nFill a large pot with water and season with a generous amount of salt. Bring it to a boil over high heat. \n\n\nAdd the pasta and cook according to the package instructions. Reserve a cup of pasta water, then drain the pasta in a colander. Set the colander over the pasta pot so it stays warm.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman", "Sauté the mushrooms:  \n\nMeanwhile, heat the olive oil in a large skillet over medium heat. Add the mushrooms and sauté until golden, 5 to 8 minutes. Add the mushrooms to a bowl or directly to the empty pasta pot.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman", "Make the sauce:  \n\nCarefully rinse and dry off the skillet that you used to cook the mushrooms, then put it back on the stove over medium heat. Add the butter to the skillet and let it melt. Add the garlic and sauté until fragrant, about 2 minutes. \n\n\nAdd the Parmesan, miso, and 1/2 cup reserved pasta water and stir until the cheese is melted and all ingredients are evenly combined, 2 to 4 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman", "Assemble the pasta:  \n\nAdd the sauce to the pot with the pasta and mushrooms and toss until all of the pasta is coated in sauce. Add more pasta water, if needed, to thin out the sauce. Sprinkle with fresh herbs, if using.\n\n\nServe fresh. Store leftovers in a covered container in the fridge for up to 3 days.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman"]}, {"title": "Dubu Jorim (Korean Braised Tofu)", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/dubu-jorim-korean-braised-tofu-recipe-6544036", "image_url": "https://www.simplyrecipes.com/thmb/YNmb80yrbJzh_6MzoqZqb4Okuxo=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-DubuJorim-LEAD-09-dc3d55eeb981471fa1c6a906f812cc2f.jpg", "ingredients": ["18 ounce firm tofu", "3 tablespoons rice flour", "2 tablespoons vegetable oil"], "instructions": ["Prepare the tofu:  \n\nRemove tofu from the container and slice into 1/2-inch thick slices. \n\n\nPlace the slices in a single layer on a plate or pan lined with paper towels. Place another layer of paper towels on top and press lightly to remove excess liquid. Replace the damp paper towels with dry ones and set aside while you prepare the sauce.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen", "Make the sauce:  \n\nIn a small bowl, combine the soy sauce, water, sesame oil, garlic, gochugaru, sugar, and half of the sliced scallions. Set aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen", "Dredge and fry the tofu:  \n\nPlace the rice flour in a shallow plate or bowl. Preheat a medium to large skillet over medium-high heat. When the pan is heated, add enough canola oil to coat the bottom. \n\n\nLightly dredge each piece of tofu on all sides in the rice flour. Shake off the excess.\n\n\nPlace the sliced tofu in the pan and sear until lightly golden brown, about 2 to 3 minutes. Gently flip each piece over and sear on the other side for another 2 to 3 minutes.\n\n\n\nSimple Tip!\n\nDepending on the size of your pan, you may need to sear your tofu in 2 batches. If so, add an extra tablespoon of oil to the pan before the second batch.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen", "Add the sauce:  \n\nReduce the heat to medium-low. Pour the sauce over the seared tofu. Carefully lift the sides of each piece of tofu to allow the sauce to go underneath. Simmer for 2 to 3 minutes.\n\n\nGently flip each piece over and simmer until the sauce starts to bubble and thicken and the tofu is coated in the sauce, another 2 to 3 minutes. If at any time you feel you need more liquid, add 1 or 2 tablespoons of water to the pan.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen", "Plate and serve:  \n\nRemove from the heat. Arrange the braised tofu on a plate and pour any remaining sauce in the pot over the tofu. Top with the remaining sliced scallions and more sesame seeds. \n\n\nStore any leftovers in an airtight container for 3 to 4 days.\n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Cynthia Christensen"]}, {"title": "Spaghetti Aglio e Olio (Pasta With Garlic and Oil)", "time needed": "21 mins", "url": "https://www.simplyrecipes.com/spaghetti-aglio-e-olio-pasta-with-garlic-and-oil-recipe-6455612", "image_url": "https://www.simplyrecipes.com/thmb/Qn2EPpYcZCWNatF_2vu2JsqoQYc=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Spaghetti-Aglio-e-Olio-LEAD-4a-4d3531e19e61464a85f2dd4c6b387dc9.jpg", "ingredients": ["1 teaspoon kosher salt", "1 pound spaghetti", "1/3 cup extra-virgin olive oil", "4 cloves garlic cloves garlic", "1/2 teaspoon crushed red pepper flakes", "1/2 cup grated Parmesan cheese", "2 tablespoons Italian parsley"], "instructions": ["Cook the pasta:  \n\nFill a large, heavy pot with water and add enough salt that it tastes like the sea (2 tablespoons or so). Bring to a boil. \n\n\nAdd the spaghetti and cook until just shy of al dente. You want it ever-so-slightly undercooked. Scoop 1 cup of pasta water out of the pot before draining the spaghetti into a colander.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Make the sauce:  \n\nReturn the pot to the stove and set over medium heat. Add the olive oil and allow it to heat up enough that it sizzles gently when you add a sliver of garlic. \n\n\nAdd the garlic and red pepper flakes. Sauté, stirring constantly, until the garlic turns slightly golden (but don’t let it brown), about 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Toss the pasta:  \n\nAdd the reserved 1 cup of pasta cooking water to the pot and adjust the heat so that the liquid simmers. Add the pasta and cook, stirring regularly with tongs. You want the heat high enough that you hear the sizzle of the liquid. \n\n\nAfter a few minutes, when the pasta has absorbed nearly all of the liquid, remove the pot from heat. Add 1 teaspoon salt and the Parmesan and stir well. Taste and add more salt, if needed. \n\n\nTransfer to a serving bowl (or serve in the cooking pot) and scatter the parsley over the top, if using. \n\n\nServe immediately with more Parmesan to pass at the table. \n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel"]}, {"title": "Air Fryer Salmon", "time needed": "15 mins", "url": "https://www.simplyrecipes.com/air-fryer-salmon-recipe-5409236", "image_url": "https://www.simplyrecipes.com/thmb/XZKBn4yDuJw5rW_x0xbuNZVaUj4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Air-Fryer-Salmon-METHOD-05-248a912ac7044b3c8b6562081aa033c3.jpg", "ingredients": ["Nonstick spray Nonstick spray Nonstick spray", "4 salmon fillets salmon fillets", "1 tablespoon olive oil", "1 teaspoon lemon pepper", "1/2 teaspoon kosher salt", "1/4 teaspoon black pepper", "Lemon wedges Lemon wedges Lemon wedges"], "instructions": ["Prepare the air fryer basket:   \n\nLightly spray the inside of the air fryer basket with nonstick cooking spray.", "Season the salmon:   \n\nPlace the salmon on a plate skin side down. Drizzle the tops (the skinless sides) with olive oil and season with lemon pepper, salt, and black pepper.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Air fry the salmon:   \n\nPlace the salmon in the air fryer basket. Make sure they aren’t touching. I like to place mine skin-side down, but skin-side up is also an option. If you’d like, place a few lemon slices under each piece of salmon.\n\n\nAir fry the salmon for about 8 minutes at 350˚F. The salmon is done when it reaches an internal temperature of 135°F to 140˚F when measured with an instant read thermometer. You can cook it longer if you want a slightly more well-done piece.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Serve the salmon:   \n\nServe the salmon with fresh lemon wedges for squeezing on top. \n\n\nRefrigerate leftover salmon for up to 3 days. \n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "Sheet Pan Gnocchi with Zucchini, Tomatoes, and Bell Peppers", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/sheet-pan-gnocchi-with-zucchini-tomatoes-and-bell-peppers-recipe-5705925", "image_url": "https://www.simplyrecipes.com/thmb/NU8rj8aPydTbgE3QSOmsRNK-fK4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Sheetpan-Gnocchi-LEAD-10-fa977cbe9da14175be0ab8c4fe6a0790.jpg", "ingredients": ["1 red onion red onion", "1 red bell pepper red bell pepper", "4 cloves garlic cloves garlic", "14 ounces zucchini noodles", "1 pint cherry tomatoes", "14 ounces gnocchi", "1/4 cup olive oil", "1 1/2 teaspoons kosher salt", "1/4 teaspoon ground black pepper", "4 large basil leaves large basil leaves", "1/4 cup shredded Parmesan"], "instructions": ["Preheat the oven to 450°F.", "Season the gnocchi and vegetables:  \n\nPlace the onions, bell peppers, garlic, zucchini, tomatoes, and gnocchi into a large mixing bowl (separating any of the gnocchi if they’re sticking to each other). Add the olive oil, salt and pepper and mix thoroughly with a wooden spoon.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Divide gnocchi and vegetables on baking sheets:  \n\nDivide the gnocchi and vegetables between 2 rimmed baking sheet and spread everything out as much as possible.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Roast the gnocchi and vegetables:  \n\nRoast the gnocchi and vegetables until all of the ingredients are tender and some have slightly browned spots where they’re touching the pan, 20-25 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Mash garlic cloves and incorporate into gnocchi and vegetables:  \n\nRemove the pans from the oven and set it on the stove or another heat-proof surface. \n\n\nFind the garlic cloves, and carefully (without burning yourself) squeeze them out of their skins, then placing the cloves in a corner of the sheet pan so you can mash it. \n\n\nUse a fork to mash each clove into a paste, then use a spatula or a wooden spoon to toss all of the ingredients (carefully loosening any bits that are sticking to the pan).\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Serve:  \n\nDivide the gnocchi and vegetables onto 4 plates and sprinkle with basil and cheese on top of each serving. Serve.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Storage and reheating:  \n\nThe gnocchi and vegetables can be stored in the refrigerator in an airtight container for up to 1 week. \n\n\nTo reheat, spread it out on a sheet pan, cover it with foil, and put it in a 350°F oven for about 10 minutes, until everything is heated through; the exact timing will depend on the size of your gnocchi and how crowded your pan is.\n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Blackened Shrimp Tacos", "time needed": "31 mins", "url": "https://www.simplyrecipes.com/blackened-shrimp-tacos-recipe-5525631", "image_url": "https://www.simplyrecipes.com/thmb/utNMC_z1BZt38VxKvXkZDSgnZGA=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Blackened-Shrimp-Tacos-LEAD-03-3e762691b6224f85a2bb3f94ecf85052.jpg", "ingredients": ["2 pounds shrimp", "2 teaspoons blackened seasoning", "1/2 teaspoon salt", "8 tortillas tortillas"], "instructions": ["Preheat the oven to 300°F.    \n\nWrap the tortillas in foil and place them on a baking sheet or pan.", "Season the shrimp:  \n\nIn a large bowl combine the shrimp, blackening seasoning, and salt.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill", "Warm the tortillas:  \n\nBake the foil-wrapped tortillas until the they are warmed through, about 10 minutes. (If your tortillas are done before you finish the slaw and shrimp, turn off the oven, and leave the tortillas inside to stay warm until you are ready to assemble.)\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill", "Make the cabbage slaw:  \n\nIn a large bowl, combine the cabbage, mayo, sugar, black pepper, and white vinegar.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill", "Cook the shrimp:  \n\nIn a large nonstick skillet over medium-high heat, add in the oil. Once it’s hot, add the shrimp.\n\n\nCook, until the shrimp have slightly browned on the outside and they have cooked through turning pink throughout, flipping halfway through, 2 to 3 minutes per side.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill", "Assemble the tortillas:  \n\nPlace the tortillas in a serving platter or plates. Divide the shrimp and slaw equally between the tortillas.", "Garnish and serve:   \n\nGarnish with cheese and cilantro. Serve with lime wedges. Serve.", "Storage:  \n\nI recommended eating the assembled tacos that same day! If you have leftover shrimp or slaw feel free to store in separate air tight containers in the fridge for up to 2 days.\n\n\nDid you love the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sharee Hill"]}, {"title": "Fresh Corn Pasta", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/fresh-corn-pasta-recipe-5498381", "image_url": "https://www.simplyrecipes.com/thmb/n48WAl7ca-JyFRlcI_WBajTLwQI=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Creamy-Corn-Pasta_LEAD-2-52076d113d4f4fa2bdb656513f31c070.jpg", "ingredients": ["8 ounces conchiglie", "3 ears sweet corn", "2 tablespoons olive oil", "1 shallot shallot", "2 cloves garlic cloves garlic", "3/4 teaspoon kosher salt", "1/4 teaspoon crushed red pepper flakes", "1/4 cup white wine", "1/2 cup heavy cream", "1/2 cup grated Parmesan cheese", "1/4 cup fresh parsley", "1 tablespoon fresh lemon juice"], "instructions": ["Cook the pasta:  \n\nBring a large pot of water to a boil over high heat and season generously with salt. Add the pasta, stir, and cook until al dente according to the package directions. Reserve a cup of pasta water just before draining.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Meanwhile, remove the corn form the cob:  \n\nShuck the corn, discarding the husks and removing as much of the silks as possible.\n\n\nSet a large, shallow bowl in the sink. Hold a shucked ear of corn by the stalk end and position it upright with the tapered end steadied against the bottom of the bowl. Use a large knife to shave the corn kernels from the cob, working in long strips down towards the bottom of the bowl. \n\n\nOnce all the kernels are removed, run the back of the knife down the entire ear using the same motion. This will remove any creamy juice left behind on the cob which gives the pasta lots of flavor. Repeat with the remaining ears of corn.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Make the sauce:  \n\nIn a large skillet, heat the olive oil over medium heat. Once hot, add the shallot and sauté until translucent, 1 to 2 minutes. Add the garlic and cook until fragrant, about 30 seconds.\n\n\nAdd the corn and their juices, 1/2 teaspoon salt, and the red pepper flakes. Stir. Add the white wine and simmer until most of it has cooked off, about 2 minutes.\n\n\nAdd the cream and bring to a low simmer, reducing the heat as needed. Cook until thickened, about 3 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Finish the sauce and toss with the pasta:  \n\nAdd the Parmesan to the sauce a little at a time, stirring each time to ensure it melts. Add the parsley, reserving a small handful for garnish. Add the lemon juice and stir to combine.\n\n\nAdd the drained pasta and 1/3 cup of reserved pasta water to the sauce. Increase the heat to medium and toss continuously until all of the pasta is coated and the sauce is clinging to the pasta. If needed, add more pasta water, a tablespoon or so at a time, and keep tossing until you have a creamy sauce.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Garnish and serve:  \n\nTaste the pasta, adding more salt and red pepper flakes, if needed. Spoon onto plates or into bowls and top with the remaining parsley. Serve immediately.\n\n\nThis pasta is best eaten fresh, but leftovers will keep in an airtight container for up to 3 days. Reheat gently in the microwave or in a nonstick skillet, adding a splash or 2 of water or cream to loosen the sauce.\n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Whole Grilled Eggplant", "time needed": "35 mins", "url": "https://www.simplyrecipes.com/whole-grilled-eggplant-recipe-5496695", "image_url": "https://www.simplyrecipes.com/thmb/ouZlKkeRzutHCcw0W5FJc3_Bq6g=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Whole-Grilled-Eggplant-LEAD-07-fed5c53b876a4b749fa7cac8755f75f2.jpg", "ingredients": ["1- pound eggplant"], "instructions": ["Preheat a gas grill to 500°F set to medium-high heat.   \n\nAdjust the grill as needed during cook time in order to maintain a temperature between 450°F to 500°F.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang", "Poke slits in the eggplant for steam to escape:   \n\nWith a sharp knife, poke 10 shallow slits spread out around the surface of the eggplant, this will help steam escape, so the eggplant doesn’t abruptly burst open as it cooks. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang", "Grill the eggplant:   \n\nPlace the eggplant on the preheated grill using tongs and close the lid. The grill will be smoky, that’s okay, as there is no oil (or fat) to cause a flare up. \n\n\nAfter 20 minutes, check on the eggplant. If it looks deflated or sunken in on itself and the grilled side is softened to the touch, it’s ready to be flipped. If not, wait another 5 minutes, then use a pair of tongs to flip it to finish cooking until it’s softened all over and mushy between the tongs, 5 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang", "Let the eggplant cool a bit:  \n\nOnce the eggplant is completely cooked through, use the tongs to gently remove it from the grill and onto a cutting board. Let it cool for 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang", "Slice the eggplant and transfer to serving plate:  \n\nSlice it in half lengthwise and transfer the halves to a serving plate. Loosely drag a fork through flesh to loosen the eggplant so the eggplant flesh is distributed into the nooks and crannies.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Mike Lang", "Garnish and serve:  \n\nLightly drizzle the eggplant with extra virgin olive oil and squeeze a lemon half over the top. Season with flakey sea salt and freshly cracked black pepper. Garnish with parsley.\n\n\nTaste and adjust with additional salt, pepper, and lemon juice if needed. \n\n\nThe eggplant skin will get pretty charred, so we recommend just eating the eggplant flesh. \n\n\nStore leftovers in an airtight container or zip top bag and it will last in the fridge for 2 days.\n\n\nDid you love the recipe? Leave us stars below!"]}, {"title": "Salmon with Brown Sugar Glaze", "time needed": "22 mins", "url": "https://www.simplyrecipes.com/salmon-with-brown-sugar-glaze-recipe-5496354", "image_url": "https://www.simplyrecipes.com/thmb/zLz94__Qiha3wG3F5F90il-klNA=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/SImply-Recipes-Salmon-Brown-Sugar-Glaze-SEO-2-9cdc4934f42f42b984b229fc55370880.jpg", "ingredients": ["2 tablespoons light brown sugar", "1 tablespoon Dijon mustard", "1 tablespoon honey", "1 teaspoon kosher salt", "1/4 teaspoon ground black pepper", "1/4 teaspoon crushed red pepper flakes", "8 ounce salmon filets"], "instructions": ["Preheat the oven to 425°F.  \n\nPosition a rack in the center, line a sheet pan with foil, and set it aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Prepare the glaze:   \n\nIn a small bowl, stir the brown sugar, mustard, honey, salt, black pepper, and red pepper flakes until smooth and drizzly.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Dry and glaze the salmon:  \n\nIf you like to eat the salmon skin, pat it very, very dry with a clean dish towel or paper towels. Skip this step if you prefer not to eat the skin. \n\n\nPlace the filets, skin side-down and with space between each filet, on the prepared sheet pan. \n\n\nSpoon the glaze onto the filets, making sure it fully covers the tops. Use the back of the spoon to spread it out.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Bake and serve:   \n\nBake until the tops are golden brown and crispy in spots. The salmon will feel slightly firm when pressed with your fingers and it should flake easily with a fork, 12 to 14 minutes. If your filets are thin (less than an inch thick), start checking for doneness at the 10-minute mark. A digital thermometer inserted into the thickest part of the salmon should register between 125°F and 130°F—this is considered cooked medium.\n\n\nUse a spatula to transfer the salmon onto plates and serve warm. \n\n\nStore leftovers in the fridge for up to 4 days. To reheat, place it on a foil-lined sheet pan and bake it slowly at 300°F until warmed through. This low and slow method will prevent the salmon from drying out too much.\n\n\nDid you love the recipe? Leave us a review below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Corn and Ricotta Bruschetta", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/corn-and-ricotta-bruschetta-recipe-5324635", "image_url": "https://www.simplyrecipes.com/thmb/EYpGFfDaVmQjHZdI3syoQNa_wxE=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/SimplyRecipes-Corn-Bruschetta-LEAD-1-2f6a35c5fce34d5f8ca6f201b5def06f.jpg", "ingredients": ["2 ears corn", "2 tablespoons unsalted butter", "1/2 red onion red onion", "1/2 teaspoon kosher salt", "1/4 teaspoon ground black pepper", "8 mint leaves mint leaves", "8 slices batard", "16 ounces ricotta cheese"], "instructions": ["Cut the corn off the cob:  \n\nWith a sharp knife, cut the corn off of the cobs into a medium bowl, removing as much of the kernels flesh as possible. \n\n\nThe method I use: hold your shucked corn cob vertically inside a medium bowl, holding the stem and letting the tip of the cob sit in the bottom of the bowl. Use a chef’s knife to cut the kernels off from top (the end you’re holding) to bottom (the tip in the bowl), in a downward motion, rotating the cob to get all the sides.  \n\n\nSet aside. You should have 2 1/4 cups of shucked corn.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the onions:  \n\nIn a medium pan, melt 1 tablespoon of butter over medium heat. Add the onion, and cook, stirring frequently, until it begins to soften, about 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the corn:  \n\nAdd the corn and the remaining 1 tablespoon of butter, and cook, until the corn is softened, about 5 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Season and add mint:  \n\nSeason with the salt and pepper. Add the mint, and cook, stirring, until the mint just starts to soften and becomes fragrant, about 30 second.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Let the topping cool:  \n\nRemove the pan from the heat, and set aside to cool for about 10 minutes, until the corn is warm but not hot.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Toast the bread:  \n\nWhile the corn is cooling, toast the bread in your toaster. (If the bread is tender and thick, you may need to toast each slice twice to get it lightly crispy on its surface. Set aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Spread the ricotta on the toasts:   \n\nWhen the corn is done cooling, spoon even portions of ricotta onto each slice of toast (about 3 1/2 tablespoons on each slice) and use the back of the spoon to spread it out almost to the edges.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Top the ricotta with corn:   \n\nDivide the corn mixture between the toasts (about 3 tablespoons per slice) and spread it out almost to the edge of the ricotta.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Garnish and serve:  \n\nGarnish with mint and serve.\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Sesame Soba Noodles", "time needed": "14 mins", "url": "https://www.simplyrecipes.com/sesame-soba-noodles-recipe-5324410", "image_url": "https://www.simplyrecipes.com/thmb/X0yIop654jIFxN4WmPjWQ3r3IG4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/SimplyRecipes_SesameSobaNoodles_SEO-8006a44b813d4513998c9df2f98d5588.jpg", "ingredients": ["9 ounces soba noodles", "1/4 cup toasted sesame oil", "3 tablespoons soy sauce", "2 tablespoons maple syrup", "2 tablespoons fresh lemon juice", "2 tablespoons sesame seeds", "2  green onions", "1 clove garlic", "1/4 teaspoon ground black pepper"], "instructions": ["Cook the soba noodles:   \n\nFill a large pot with about 3 quarts of water and set it over high heat. You don’t need to salt the water. Cover the pot with a lid if you’re hangry and need it to boil faster. \n\n\nWhen it comes up to a boil, add the soba noodles and cook for 4 minutes, stirring frequently with a large fork so that they don’t stick to each other or to the bottom of the pot. \n\n\nDrain the noodles into a colander set in the sink and immediately rinse it with cold running water until the noodles feel cool to the touch. Leave the colander in the sink to give the noodles a chance to drain well.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Meanwhile, make the dressing:   \n\nIn a large bowl, add the sesame oil, soy sauce, maple syrup, lemon juice, sesame seeds, green onions, garlic, and black pepper. Whisk well with a fork until combined.\n\n\n\nSimple Tip!\n\nI often rinse out the same pot used to cook the noodles and make the dressing in it.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Dress the noodles:   \n\nTap the colander in the sink forcefully a few times to get rid of as much water as possible. Tip the noodles on top of the dressing and use the fork to toss until evenly coated. Serve at room temperature or chilled after you pop it into the fridge until ready to serve. \n\n\nLeftovers taste even better since the noodles get a chance to soak up the dressing without getting mushy. It can be refrigerated for up to 3 days. I do not recommend freezing it. \n\n\nDid you love the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Easy Grilled Pork Chops", "time needed": "76 mins", "url": "https://www.simplyrecipes.com/easy-grilled-pork-chops-recipe-5295685", "image_url": "https://www.simplyrecipes.com/thmb/pGCenx2Yldg5dxidIn-TxZvEXOg=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Grilled-Pork-Chops-LEAD-2-f3dae1ed11a24bcea68359f35fec82be.jpg", "ingredients": ["4 1/2 cups pork chop brine", "4 pork rib chops pork rib chops", "1 1/2 teaspoons kosher salt", "1 teaspoon ground", "1/2 teaspoon ground black pepper", "1/4 teaspoon paprika", "Pinch cayenne pepper cayenne pepper", "1 tablespoon vegetable oil"], "instructions": ["Brine the pork chops:   \n\nIn a large pot or bowl, add the cooled brine and the pork chops, making sure all of them are fully submerged in the brine. You can place a heavy plate on top to help them stay submerged. Cover and refrigerate for 1 hour. \n\n\nRemove the pork chops from the brine. Rinse them under cold running water, then pat them dry with paper towels. Lay the pork chops on a platter so that they come to room temperature while the grill heats.\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes", "Heat the grill:  \n\nUse a grill brush to clean the grill grates. Saturate a wad of paper towel generously with vegetable oil and rub it along the grates. If using a gas grill, heat one side to 400°F or high and keep the burners off on the other side. If using a charcoal grill, spread the hot coals on one half of the grill and leave the other half empty.", "Season with the spice rub:  \n\nIn a small bowl, combine the salt, cumin, black pepper, paprika, and cayenne pepper, if using. Use your hands to rub both sides of the pork chops with the oil. Sprinkle and massage the spice rub all over them.\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes", "Grill the pork chops:   \n\nWhen the grill reaches 400°F, place the pork chops on the hot side of the grill and press down firmly with a grill spatula. Sear for 4 minutes without moving them. This allows the meat to caramelize properly. Flip them over and sear for 4 minutes without moving them. \n\n\nMove the seared pork chops to the cool side of the grill, then close the lid. Cook for 15 to 20 minutes, or until a meat thermometer inserted in the center of the pork chop registers 145°F.\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes", "Allow the pork chops to rest:  \n\nTransfer the grilled pork chops onto a platter and cover it loosely with foil. Rest them for 5 minutes before serving, which will allow the juices to settle down.\n\n\nDid you love the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nMarta A Rivera Diaz / Simply Recipes"]}, {"title": "Ground Beef Bulgogi from \"Learning Korean\"", "time needed": "16 mins", "url": "https://www.simplyrecipes.com/ground-beef-bulgogi-recipe-learning-korean-5271611", "image_url": "https://www.simplyrecipes.com/thmb/GrDlSADCTKt9-gilJikLfWiLnC4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/LearningKorean_PG158_crop-580c67a58ed3413a8b370b8f49ca7a17.jpg", "ingredients": ["1 pound ground beef (see recipe note)", "1/2 medium yellow onion, sliced", "2 clove s garlic", "2  scallions,", "1 tablespoon soy sauce", "1 tablespoon sesame oil", "1 teaspoon kosher salt", "1 tablespoon maple syrup", "1 teaspoon vegetable oil"], "instructions": ["Marinate the ground beef 4 to 8 hours:  \n\nCombine all ingredients except vegetable oil in a bowl and mix together well. Allow the beef to marinate, covered in the refrigerator, for a minimum of 4 hours, ideally overnight.", "Cook the beef, then serve:  \n\nThe next day, heat the vegetable oil in a large sauté pan over medium heat and cook the ground beef thoroughly, stirring occasionally to break up any large chunks.\n\n\nServe the bulgogi hot, with lettuce or cabbage wraps and steamed rice."]}, {"title": "Shrimp and Asparagus Pasta", "time needed": "35 mins", "url": "https://www.simplyrecipes.com/shrimp-and-asparagus-pasta-recipe-5270014", "image_url": "https://www.simplyrecipes.com/thmb/hiAugwZln-J_PcriIxmeAD6DYCg=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Shrimp-and-Asparagus-Pasta-LEAD-4-b06c6ca1523f42f9ae91ad6a4e17d2ab.jpg", "ingredients": ["12 ounces spaghetti", "3 tablespoons olive oil", "1 yellow onion yellow onion", "1 pound uncooked shrimp", "1 bunch asparagus", "4 cloves garlic cloves garlic", "1/2 teaspoon kosher salt", "1/4 teaspoon ground black pepper", "1/2 cup white wine", "3 tablespoons unsalted butter", "1 lemon, juiced lemon, juiced"], "instructions": ["Boil water for pasta:  \n\nFill a large pot with water and salt it generously. Set it over high heat and bring to a boil.", "Cook the pasta:   \n\nWhen the salted water is at a rolling boil, add the pasta. Cook the pasta according to the package instructions, until it is just 1 minute shy of al dente, very nearly cooked but slightly too firm in the center, about 10 minutes.\n\n\nDrain the pasta in a colander, reserving 1 cup of pasta water to add to the shrimp and asparagus.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes", "Cook the shrimp and asparagus:   \n\nWhile the pasta is cooking, start cooking the other ingredients.\n\n\nIn a Dutch oven over medium-high heat, add the olive oil. When the oil is hot, add the onions and cook, stirring frequently, until it begins to soften, about 3 minutes. Add the shrimp, asparagus, and garlic. Increase the heat on the stove to high, and cook, stirring occasionally, until the side of the shrimp have just turned pink, about 4 minutes. Season with the salt and pepper.\n\n\nReduce the heat to medium and add the white wine and 2 tablespoons of the butter to the pan. Bring the sauce to a simmer and cook for about 2 minutes. Add the lemon juice to the pan. Season with additional salt and pepper, to taste. Continue to cook until the asparagus is just tender and the widest part of the shrimp has turned from translucent to opaque, about 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes", "Finish the dish:  \n\nAdd the drained pasta to the pan with 1/2 cup of the reserved pasta water and the remaining 1 tablespoon of butter. Cook, stirring occasionally and using tongs to coat the pasta with all of the ingredients in the pan. Stir, until the pasta is tender but still firm in the center, 1 to 2 minutes.\n\n\nYou can add more of the pasta water if the pan gets dry before the pasta is done; you should end up with a slick of sauce coating all of the ingredients. Taste and adjust with more salt and pepper to taste.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes", "Serve:   \n\nPortion the pasta onto four plates. Top each one with Parmesan and parsley. Serve with a lemon wedge on the side.\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel / Simply Recipes"]}, {"title": "Philly Cheesesteak Sloppy Joes", "time needed": "40 mins", "url": "https://www.simplyrecipes.com/philly-cheesesteak-sloppy-joes-recipes-5248762", "image_url": "https://www.simplyrecipes.com/thmb/YDqx_9t6A_7xoyyMIgCRLeLraDU=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Philly-Cheesesteak-Sloppy-Joes-LEAD-01-7e49dd9506eb4c6c88db188313be4c36.jpg", "ingredients": ["2 tablespoons unsalted butter", "1 small white onion", "1 pepper green bell", "1 pound lean beef", "1/2 cup beef stock", "1/4 cup ketchup", "2 tablespoons Worcestershire sauce", "1/2 teaspoon garlic powder", "1/2 teaspoon kosher salt", "1/2 teaspoon black pepper", "12 slices provolone cheese", "6 bun brioche buns"], "instructions": ["Cook the vegetables:  \n\nIn a large skillet set over medium heat, melt the butter. Add the onions and bell peppers. Cook until soften, 6 to 7 minutes, stirring frequently. The vegetables shouldn’t brown at this point, just soften.\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes", "Cook the beef:    \n\nAdd the ground beef and use a wooden spoon to break it up into small pieces as it cooks. Cook until the meat is browned, 5 to 6 minutes.\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes", "Make it saucy:  \n\nStir in the stock, ketchup, Worcestershire sauce, garlic powder, salt, and black pepper. Turn the heat down to low and simmer for 4 to 5 minutes until the mixture thickens.\n\n\nStack 6 slices provolone cheese on a cutting board and use a chef’s knife to cut them into 1/2-inch pieces. Right before serving, stir in the cut cheese.\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes", "Assemble the sloppy joes:   \n\nToast the brioche buns in a toaster oven or toaster. Lay the remaining 6 slices provolone cheese on each brioche bun half. Top the cheese with heaping spoonfuls of the sloppy joe mixture and the top bun. Serve warm.\n\n\nIf you have leftover sloppy joe mixture, good news! It keeps beautifully in the fridge for 4 to 5 days and reheats well in the microwave or in a skillet with a splash of water or stock. \n\n\nYou can freeze the mixture in freezer-safe container for 3 months. Thaw it before reheating. If you need to thaw it quickly, you can do so in the microwave.\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nNick Evans / Simply Recipes"]}, {"title": "Easy Beef Bulgogi", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/beef-bulgogi-recipe-5235423", "image_url": "https://www.simplyrecipes.com/thmb/2DOCfCh__S0Dd9-tI6ZW1PmHAu4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Bulgogi-SEO-daf49e25a78d41ccbf66aba56b50520f.jpg", "ingredients": null, "instructions": ["Make the marinade:  \n\nIn a medium bowl, add the soy sauce, grated pear, mirin, sugar, garlic, sesame oil, and black pepper. Stir until the sugar dissolves.\n\n\n\n\n\n\n\n\n\n\n\nCiara Kehoe / Simply Recipes", "Marinate the beef:   \n\nAdd the beef and toss until it is evenly coated with the marinade. Cover it with plastic wrap and refrigerate for at least 30 minutes or overnight. At this point, you can put the marinated beef in a zip top bag and freeze it for later.\n\n\n\n\n\n\n\n\n\n\n\nCiara Kehoe / Simply Recipes", "Cook the bulgogi:   \n\nHeat the canola oil in a large cast iron grill pan over medium-high heat. Make sure the pan is hot before you add the bulgogi. Add the bulgogi in a single layer. You may need to cook it in batches. The meat should not overlap so that it chars nicely without steaming and releasing liquid. Cook until lightly charred and cooked through, 2 to 3 minutes on each side.\n\n\n\n\n\n\n\n\n\n\n\nCiara Kehoe / Simply Recipes", "Serve:  \n\nTransfer the bulgogi onto a serving platter or serve it straight from the pan. Sprinkle the green onions and sesame seeds on top. Serve it while hot with cooked rice on the side.\n\n\nLeftovers can be tightly covered and refrigerated for up to 5 days.\n\n\nDid you love the recipe? Leave us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nCiara Kehoe / Simply Recipes"]}, {"title": "Gholpi (Afghan Stewed Cauliflower)", "time needed": "35 mins", "url": "https://www.simplyrecipes.com/gholpi-afghan-stewed-cauliflower-recipe-5225791", "image_url": "https://www.simplyrecipes.com/thmb/yq_iBz-z0sZonv6i0xJ8wd7IHmk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Gholphi-Afghan-Stewed-Cauliflower-LEAD-03-d24500a117444c6ea6057f7fb0bfc60d.jpg", "ingredients": null, "instructions": ["Cook the onions:   \n\nIn a ghablama, wok, or large sauté pan set over medium-high heat, add the onions. Sauté them, without any oil for about 4 minutes, until they soften, keeping a lid on as much as possible to trap steam. It’s okay if they brown around the edges. If they start charring, lower the heat and continue stirring. \n\n\nStir in the oil and reduce the heat to medium. Continue to sauté for about 2 minutes, until the onions are tender and translucent.\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes", "Add the peppers and seasonings:   \n\nCut off the stem and thinly slice 1 Anaheim pepper. Add the sliced peppers, tomato paste, curry powder, advieh, felfel, black pepper, and turmeric to the cooked onions. Sauté for about 2 minutes, stirring frequently.\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes", "Cook the cauliflower:   \n\nStir in the cauliflower florets, 3/4 cup water, and salt. Cover with a lid and cook for 12 to 15 minutes, stirring occasionally, until you can easily pierce the florets with the tip of a paring knife. Taste the sauce and season with more salt, if needed.\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes", "Meanwhile, char the Anaheim peppers:  \n\nSet a small frying pan over medium-high heat. When it’s hot, add the remaining 2 Anaheim peppers. Do not move them until they start to char, then turn them every 2 to 3 minutes to char them all over. This will create some peppery smoke, so open your windows!", "Serve:   \n\nTransfer the gholpi onto a serving platter, being careful not to break or smash the florets. Set the charred peppers on top and serve warm with barbari or lavash.\n\n\nLeftovers can be refrigerated for up to 5 days.\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nJohn Robinson / Simply Recipes"]}, {"title": "Grilled Shrimp with Konkani-Inspired Masala", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/grilled-shrimp-with-masala-paste-5225101", "image_url": "https://www.simplyrecipes.com/thmb/NCXKtKk0goEwYdYe3VeKENDKkBU=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Grilled-Shrimp-Konkani-Masala-LEAD-02-f7997aced0a14f2abfd569c7cd36721b.jpg", "ingredients": null, "instructions": ["Season the shrimp:   \n\nIn a medium bowl, use a wooden spoon to toss shrimp with kosher salt and ground turmeric until combined. Keep covered with plastic wrap or foil in the fridge while you prepare the spice paste.", "Toast the chilies and coconut powder:   \n\nIn a small skillet over medium heat, add 1 teaspoon canola oil. Wait 1 minute, add the chilies, and use tongs to turn them every 30 seconds. Toast chiles until aromatic and softened, about 1 1/2 to 2 minutes. Remove chiles from the pan and set aside.\n\n\nReduce the heat to medium-low. Add the coconut powder and stir occasionally until toasted all over and light golden brown, about 2 minutes. Remove from the heat and set aside. Wipe the skillet clean.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Prepare the chiles:   \n\nWear gloves and use scissors to remove the stem, squeeze out the seeds, and remove the membrane of the chile. \n\n\nRoughly chop the chiles, then place them into a small spice grinder or food processor and grind into a powder the texture of finely crushed chile flakes. \n\n\nAvoid inhaling while grinding, as it can irritate your nose and throat and cause a lot of sneezing!\n\n\nMeasure out 1 1/2 teaspoons chili powder for a mild spice/heat and 1 tablespoon for medium spice/heat. (Any remaining chili powder can be kept in the fridge up to 1 week and sprinkled on dishes as a condiment).\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Grind the paste:   \n\nPlace the chili powder, coconut powder, coriander seeds, garlic, shallot, tamarind paste, and water in a small food processor. Grind until smooth (it’s okay to have a few residual minced pieces of garlic, but otherwise the texture should be quite homogeneous).\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes\n\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Cook the paste:   \n\nSet the cleaned skillet to medium heat and add 2 tablespoons canola oil. Add the paste in and cook, 1 1/2 to 2 minutes or until the color slightly darkens from orange to burnt orange. The paste should have thickened slightly and begun lightly sticking to the pan. Remove the paste and let cool to room temperature, about 20 minutes.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Prepare the grill and skewers:  \n\nMeanwhile, pre-heat a gas grill on direct, medium-high heat (aim for 400°F to 450°F). If using wooden skewers, soak them in a bowl of water for at least 20 minutes.", "Toss shrimp with paste:  \n\nRemove the bowl of shrimp from the fridge and use a wooden spoon to stir in the paste until evenly coated.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Skewer the shrimp:  \n\nThread shrimp onto skewers, leaving at least 1/2-inch of space between each piece.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Grill the shrimp:   \n\nDip a paper towel in a bit of canola oil until soaked, then use tongs to rub the oil onto the grill grates. \n\n\nPlace the skewers on the grill. Cook for 2 minutes, or until shrimp are seared on the bottom. With tongs, flip the skewers, and cook for another 2 to 3 minutes or until shrimp are opaque and fully cooked. Remove from the grill using tongs and transfer to a serving plate.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes", "Serve:   \n\nGarnish the shrimp with cilantro and serve immediately with lemon wedges on the side.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan / Simply Recipes"]}, {"title": "Grilled Halibut with Calabrian Chile Gremolata", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/grilled-halibut-with-calabrian-chile-gremolata-recipe-5225087", "image_url": "https://www.simplyrecipes.com/thmb/pVzgmF9ZutuUZk1S7MmsxTKpmbY=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Gaby-Grilled-Fish-with-Gremolata-LEAD-04-236eb55d76a048769efddf2265c6bac2.jpg", "ingredients": null, "instructions": ["Preheat a charcoal or gas grill (or a stovetop grill pan) to 375 to 400°F.", "Prep the fish:  \n\nIn a shallow dish, whisk together the olive oil and lemon zest. Pat the fish filets dry and season on all sides lightly with kosher salt, to taste. Place in the oil and turn to coat the fish in the oil, then top with freshly cracked black pepper, to taste. Set aside while you make the gremolata.", "Make the gremolata:  \n\nIn the bowl of a food processor, pulse the parsley and garlic until chopped. Add the Calabrian chile, olive oil, red wine vinegar, kosher salt, and a few grinds of black pepper. Process until gremolata is cohesive but not too finely combined (slightly rougher texture than pesto, for example). Transfer to a bowl and set aside.", "Grill the fish:  \n\nGrease the grill grates or grill pan lightly with oil using tongs and a clean kitchen towel.\n\n\nPlace the halibut on the grill (skin side down if you didn't remove the skin) and close the lid. Grill until the fish begins to look opaque and grill marks appear on the bottom side, about 5 minutes. \n\n\nFlip the fish using tongs or a fish spatula, close the lid again, and continue to grill until the internal temperature reaches 145°F and the fish is flaky and opaque throughout, about 3 to 5 minutes.", "Garnish and serve:  \n\nTransfer to a serving platter and top with gremolata, a few parsley leaves, and flaky salt. \n\n\nDid you love this recipe? Give us some stars below!"]}, {"title": "Gyeran Jjim (Korean Steamed Eggs)", "time needed": "10 mins", "url": "https://www.simplyrecipes.com/gyeran-jjim-korean-steamed-eggs-recipe-5222914", "image_url": "https://www.simplyrecipes.com/thmb/3U3_8-byH6pMGdxmmfxNtYF3uI4=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/SimplyRecipes_GyeranJjim_LEAD-1-0cf8b301c6d942f6b0646b466e70ed7a.jpg", "ingredients": ["6 large eggs", "1 1/8 teaspoons kosher salt", "3/4 teaspoon instant dashi powder", "3 sticks imitation crab", "1 1/2 cups water", "1  scallion"], "instructions": ["Mix the eggs:   \n\nCrack the eggs into a 35-ounce (4 1/2- to 5-cup capacity) microwave-safe bowl. Vigorously whisk the eggs with a fork until smooth and combined well. Add the salt and dashi powder, and whisk again to combine. Stir in the crab sticks.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Add the boiled water:  \n\nBring 1 1/2 cups water to a boil in an electric kettle or in a small saucepan over high heat. Carefully pour the boiling water over the egg mixture and quickly stir together with the fork. The egg mixture will look thin—don’t worry if the boiling water slightly curdles the eggs, but try to work quickly for best results.  \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Microwave the eggs:  \n\nPlace the bowl on a microwave-safe plate to make it easier to get the dish in and out of the microwave and to catch any potential spills. \n\n\nMicrowave the eggs, uncovered, on high for 2 minutes, until the edges begin to set. Remove the bowl from the microwave and gently scrape around the sides and bottom with a fork, breaking up large pieces of cooked eggs and mixing them into the uncooked eggs.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe", "Cook the eggs for longer:   \n\nMicrowave the eggs again for 1 minute. Then gently scrape around the sides and bottom with a fork.", "Add scallions and finish cooking:  \n\nSprinkle the scallions on top and microwave the eggs again for 45 seconds to 1 minute, until the eggs are just set and soft when poked with a fork. The total cook time depends on the power level of your microwave. The gyeran jjim should look like custardy scrambled eggs, soft but set without jiggling—something you can’t wait to scoop into! \n\n\nA bit of water on top is normal. I think of it as a comforting dashi soup. If the eggs look underdone, microwave in 15-second increments until cooked through. Allow the eggs to cool for a few minutes before serving. \n\n\nStore leftover gyeran jjim tightly covered in the fridge for up to 2 days. Depending on how much is leftover, reheat it in the microwave for 45 seconds to a minute and a half, just enough to warm the eggs through. \n\n\nDid you love the recipe? Leave us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Ciara Kehoe"]}, {"title": "Creamy Chicken Florentine", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/creamy-chicken-florentine-recipe-5221334", "image_url": "https://www.simplyrecipes.com/thmb/auGbmVKINBn70ssBc2LMBcmRALk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Temp-filename_-10-ac24af938a894208adecfebd2353d04b.jpg", "ingredients": ["2 tablespoons all-purpose flour", "1/2 teaspoon kosher salt", "1/4 teaspoon ground pepper", "4  chicken cutlets", "3 tablespoons olive oil", "2 medium shallots", "8 ounces cremini mushrooms", "3 cloves garlic", "1/4 cup dry white wine", "1/2 cup heavy cream", "1 ounce grated Parmesan cheese", "12 ounces baby spinach"], "instructions": ["Dredge the chicken:  \n\nIn a shallow bowl, add the flour, 1/4 teaspoon salt and 1/8 teaspoon black pepper. Mix well with a fork or a spoon.\n\n\nLay a chicken cutlet on top of the flour. Sprinkle some of the flour mixture on top and press with your hands to coat. Flip the chicken to evenly coat both sides, sprinkling flour over any bare spots and shaking off the excess. Transfer it onto a large plate and repeat with the remaining cutlets. Discard any leftover flour.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas", "Cook the chicken:  \n\nPlace a large skillet over medium-high heat and add 2 tablespoons olive oil. Tilt the skillet to evenly coat it with oil. The oil should shimmer, but not smoke. Add the dredged chicken cutlets in a single layer. Let them cook, without moving, until the bottoms are golden brown, 3 to 5 minutes.\n\n\nUse tongs to flip the cutlets and cook the other side is lightly browned and the chicken is cooked through, 2 to 4 minutes. If your skillet isn’t big enough, you can cook the chicken in 2 batches.\n\n\nTransfer the chicken onto a clean plate and tent it with foil. Set it aside while you make the sauce, which will be made in the same skillet.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas", "Cook the vegetables:  \n\nTurn the heat down to medium and add the remaining 1 tablespoon olive oil. Add the shallots and sauté until they begin to turn translucent, about 1 minute.\n\n\nAdd the mushrooms and garlic, and season with the remaining 1/4 teaspoon salt and 1/8 teaspoon black pepper. Sauté until tender, 2 to 3 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas", "Make the sauce:  \n\nAdd the white wine and scrape the bottom of the skillet with a wooden spoon, loosening any browned bits. Bring the wine to a simmer and cook until the alcohol smell dissipates, about 1 minute.\n\n\nStir in the heavy cream. Bring it to a gentle simmer. Add the spinach in 2 or 3 batches, stirring after each addition until all the leaves are wilted and incorporated into the sauce.\n\n\nStir in the Parmesan until it is completely melted.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas", "Assemble the dish:  \n\nNestle the chicken cutlets in the sauce and let it simmer for 2 to 3 minutes to reheat. Taste the sauce and adjust the seasoning with more salt and black pepper, if needed. Serve!\n\n\nLeftovers keeps well since it has a moist sauce. Refrigerate it in an airtight container for up to 3 days and reheat it on the stovetop or in the microwave. Add a splash of heavy cream if it feels dry. \n\n\nI don’t recommend freezing this dish since the texture of the sauce gets wonky. Cream sauces have a tendency to split when frozen, thawed, and reheated.\n\n\nDid you love the recipe? Leave us a review in the comments! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Sally Vargas"]}, {"title": "Vegetarian Biscuits and Gravy", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/vegetarian-biscuits-and-gravy-recipe-5218197", "image_url": "https://www.simplyrecipes.com/thmb/QYHVVipNnCeb1b_aj_eeY1Fa9gQ=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Temp-filename_-11-0f9669c9e8ec45b4972de0743cfb7d82.jpg", "ingredients": ["240 g all-purpose flour", "2 teaspoons baking powder", "4 teaspoons sugar", "1 teaspoon salt", "2 teaspoons fresh thyme", "1 1/2 cups heavy cream"], "instructions": ["Preheat the oven to 425°F.", "Combine the dry ingredients:   \n\nUse a sifter or fine-mesh sieve set over a large bowl to sift the flour, baking powder, sugar, and salt.", "Add the thyme and heavy cream:   \n\nSprinkle the thyme over the flour mixture. Drizzle in the heavy cream. Use a wooden spoon or your hands to combine the ingredients until the flour is moistened and the dough looks shaggy. It’s okay to have some loose flour. Do not overwork the dough because it will lead to dense biscuits.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Roll out the dough:   \n\nLightly flour a work surface and turn the dough onto it. Use your hands to gather the dough so that it comes together and form it into a circle that’s about 1 inch thick.", "Form the biscuits:   \n\nDip a 2-inch round cutter in a small bowl of flour. Cut the dough into rounds, pushing straight down and lifting straight up. Cut out 3 biscuits and place them on a large ungreased baking sheet. Gather the dough and gently form it into a 1-inch thick circle again. Try not to knead or overwork the dough. Cut out 3 more biscuits and place them on the baking sheet. Leave 2 inches between each biscuit.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Bake the biscuits:    \n\nBake the biscuits for 10 to 12 minutes, until they just start to show a bit of golden color on top. Remove the biscuits from the oven and set them aside. It’s okay to leave the biscuits on the baking sheet.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Meanwhile, cook the mushrooms:   \n\nHeat a 10-inch skillet over medium-high heat. Add 3 tablespoons butter and 1 tablespoon olive oil, stirring to help the butter melt. Once the butter is fully melted, add the mushrooms and cook for 3 to 4 minutes until softened and just begging to turn brown, stirring often. If the butter starts to brown too quickly, reduce the heat to medium heat. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Add the seasonings:   \n\nAdd the shallots, garlic, fennel seeds, red pepper flakes (if using), and salt. Continue to cook, stirring often, until the shallots and garlic are soft and translucent, about 3 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Add the butter, flour, and milk:  \n\nAdd the remaining 2 tablespoons butter and 2 tablespoons olive oil and stir until the butter is melted. Sprinkle in the flour and use a wooden spoon to stir until fully combined, for 30 seconds to 1 minute. Add the milk in a steady stream while stirring continuously. The gravy should begin to thicken.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Add the thyme and spinach:   \n\nImmediately stir in the thyme. Bring the mixture up to a boil, stirring occasionally, and then reduce the heat to medium-low heat. Stir in the spinach and cook until the gravy reaches your desired thickness, about 4 minutes. If it thickens too much, stir in a bit of milk. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham", "Serve:   \n\nPlace a biscuit on a plate and spoon the gravy over it. Sprinkle a bit of freshly ground black pepper on top, if desired.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Wanda Abraham"]}, {"title": "Air Fryer Fish Sticks", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/air-fryer-fish-sticks-recipe-5705813", "image_url": "https://www.simplyrecipes.com/thmb/0r2ENsSglRdgDDSwpV7onHSW964=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Air-Fryer-Salmon-LEAD-05-7b0f6925f48b4b9cadf09e395257b692.jpg", "ingredients": ["Nonstick olive oil spray Nonstick olive oil spray Nonstick olive oil spray", "1 pound cod", "1/2 cup cornstarch", "1/2 teaspoon kosher salt", "1/2 teaspoon black pepper", "2 large eggs large eggs", "1 cup panko breadcrumbs", "1 teaspoon paprika"], "instructions": ["Prep the air fryer:   \n\nSpray your air fryer pan with nonstick spray. Some people prefer to preheat their air fryer, but I think it’s optional for this recipe.", "Prepare the breading station:   \n\nCombine the cornstarch, salt, and pepper in a large shallow dish. In a separate shallow plate, whisk the eggs. Add panko and paprika to a third shallow dish.", "Bread the fish:   \n\nAdd fish sticks into the cornstarch and toss well to coat. Then add to egg mixture to coat and finally add to panko breadcrumbs making sure to coat all sides.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Air fry the fish sticks:   \n\nWorking in batches, add fish sticks to your air fryer basket in an even layer. Spray them lightly with cooking spray.\n\n\nAir fry for 6 minutes at 375˚F. Flip fish sticks using tongs and air fry for another 4 to 6 minutes until golden brown. Season with salt to taste, if desired.\n\n\nRepeat with second batch of fish sticks.\n\n\n\nSimple Tip!\n\nYou can keep cooked fish sticks in a warm, 250˚F oven, so they stay warm and crispy while you make the second batch.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Make the pickle and caper tartar sauce:  \n\nIn a small bowl, combine mayonnaise, fresh lemon juice, minced pickles, capers, and kosher salt. Mix until well combined.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Serve:  \n\nGarnish with parsley or dill, if desired. Serve fish sticks with tartar sauce and lemon wedges. \n\n\nLeftovers keep fine in the fridge for a few days in an airtight container. To reheat, air fry at 350˚F for 3 minutes.\n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "BLT Wraps", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/blt-wraps-recipe-5524667", "image_url": "https://www.simplyrecipes.com/thmb/dXUNl0jdIQ3y2ydxDz3mfpkGKPk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-BLT-Wraps-LEAD-02-75aa2ed533104c52bdb7407575cb7bc5.jpg", "ingredients": ["1 pound bacon", "1 head butter lettuce", "3 small tomatoes", "6 burrito-size tortilla burrito-size tortilla"], "instructions": ["Preheat oven to 375˚F.", "Cook the bacon:   \n\nArrange the bacon on a few baking sheets with foil or elevate them on a wire rack, making sure the bacon is not overlapping.\n\n\nBake the bacon for 15-20 minutes until it’s browned and crispy. Then remove the bacon from the baking sheet and let it drain on a few paper towels.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Make the chive mayo:   \n\nIn a medium bowl combine the mayo, chives, lemon juice, garlic powder, and salt. Set aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Assemble the wraps:  \n\nSpread about 2 tablespoons of the chive mayo onto your wrap. Then layer with butter lettuce, tomato slices, followed by 3-4 strips of crispy bacon. \n\n\nFold the edges over on the wrap and roll it into a tight cylinder. Cut the wrap in half for easier eating.\n\n\nContinue until all wraps are assembled.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Packing the wrap for lunch:   \n\nRoll the wrap tightly in foil and keep it in the fridge until you leave. I like to pack the wraps in a bag with a cold pack, but they are fine wrapped up for a few hours also. I think the wrap is best when the lettuce is nice and crispy and cold. \n\n\nWrap ingredients all keep well in the fridge for 1 week. Make wraps on the day you are eating them!\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "Sesame Peanut Noodles", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/quick-and-easy-sesame-peanut-noodles-5498716", "image_url": "https://www.simplyrecipes.com/thmb/sFZmbqLAOeLTFSneJmrapM7nqtY=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Sesame-Peanut-Noodles-LEAD-02-3b0190bdb28b4eec80c4c93992f4c6d7.jpg", "ingredients": ["8 ounces soba", "2 tablespoons toasted sesame oil", "3 tablespoons natural peanut butter", "1/4 cup soy sauce", "1 1/2 tablespoons honey", "1 1/2 tablespoons rice vinegar", "1 clove garlic clove garlic", "1 tablespoon toasted sesame seeds", "1 green onion green onion"], "instructions": ["Cook the noodles:  \n\nBring a large pot of water to a boil over high heat. Add the noodles and cook following package instructions. Drain into a colander set in the sink, then rinse with cold running water until cool to the touch. Drain well. \n\n\nTransfer into a medium bowl and toss them with 1 tablespoon sesame oil so that they don’t stick to each other. Cover with plastic wrap and place them in the fridge to keep cool while you prepare the sauce.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman", "Prepare the sauce:  \n\nIn a small bowl, add the remaining 1 tablespoon sesame oil, peanut butter, soy sauce, honey, rice vinegar, and garlic. Whisk with a fork until combined and smooth.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman", "Assemble the noodles:  \n\nScrape the peanut sesame sauce on the cold noodles and toss to combine. Garnish with sesame seeds and green onions, if desired.\n\n\nLeftovers can be stored in an airtight container in the fridge for up to 3 days. Before serving them again, toss with a little warm water to thin out the sauce.\n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Hannah Zimmerman"]}, {"title": "One-Pot Spaghetti with Tomatoes, Artichokes, and Capers", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/one-pot-spaghetti-with-tomatoes-artichokes-and-capers-recipe-5498712", "image_url": "https://www.simplyrecipes.com/thmb/0H1U3Sr-UXrS9MF9IsOic4FVMPc=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-One-Pot-Spaghetti-LEAD-5-f13afab283bf47909f7855637f8ef082.jpg", "ingredients": ["1 pound dry spaghetti", "1 pint grape tomatoes", "14 ounce artichoke hearts", "1/4 cup capers", "32 ounces low-sodium chicken stock", "1 cup basil leaves", "1/4 teaspoon kosher salt", "1/8 teaspoon ground black pepper", "1/2 cup Manchego cheese"], "instructions": ["Add all of the ingredients in a skillet:   \n\nIn a large lidded skillet, add the spaghetti, tomatoes, artichoke hearts, capers, chicken stock, basil, salt, and black pepper.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Cook the pasta:   \n\nPlace the skillet over high heat. Cover it with a lid and bring it up to a boil, stirring occasionally so that the pasta doesn’t stick. It will take 6 to 7 minutes for it to come up to a boil. \n\n\nAs soon as it comes to a boil, give the spaghetti a good stir and continue cooking it, uncovered, until al dente and the liquid has reduced to a viscous sauce, about 13 minutes. Stir it occasionally. \n\n\nAt this point, if the pasta isn’t cooked through and the skillet looks dry, add up to 1/2 cup stock or water and continue cooking. The cook time will depend on the brand of your spaghetti and the strength of your stovetop. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Add the cheese and serve:   \n\nRemove the pasta from the heat. Taste it and add more salt and black pepper, if you’d like. Sprinkle in the Manchego cheese, if using, and toss to combine. Serve warm.\n\n\nRefrigerate leftovers in an airtight container for up to 3 days. Reheat it on the stovetop over low heat with a little bit of chicken stock or water until warmed through.\n\n\nDid you love the recipe? Leave us starts below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel"]}, {"title": "Creamy One Pot Pasta with Zucchini", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/creamy-one-pot-pasta-with-zucchini-recipe-5498699", "image_url": "https://www.simplyrecipes.com/thmb/dZPZBetGgLtZTvOf_wNs0nkxY9g=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Creamy-One-Pot-Pasta-with-Zucchini-LEAD-8-98d788600d4e4344a02785ad486aeba8.jpg", "ingredients": ["1/4 cup olive oil", "2 pounds zucchini", "2 1/2 teaspoons kosher salt", "1/2 teaspoon ground black pepper", "3 1/4 cups water", "1 pound penne pasta", "6 ounces cream cheese", "1 lemon lemon", "1/4 cup walnuts"], "instructions": ["Cook the zucchini:   \n\nHeat the oil in a large heavy-bottomed pot or Dutch oven over medium-high heat. Add the zucchini and season with 1 teaspoon salt and 1/2 teaspoon black pepper. Cook the zucchini, stirring occasionally, until it expels liquid, the liquid cooks off, and the zucchini caramelizes into a jam-like, spreadable consistency, 10 to 12 minutes. \n\n\nIf you start to notice any browning at the bottom of your pot, reduce the heat to medium. Once jammy, transfer the zucchini into a medium bowl and set it aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Cook the pasta:   \n\nIn the same pot (don’t worry about wiping off any browned bits or pieces of zucchini that might be left in the pot), add 3 1/4 cups water and bring it to a boil over high heat. Season the water with the remaining 1 1/2 teaspoons salt. \n\n\nOnce water is boiling, add the pasta and cream cheese, and reduce the heat to medium-high. Break up the cream cheese with the back of a wooden spoon to disperse throughout. It’s okay if the pasta isn’t completely submerged in liquid. Cook, stirring frequently until the pasta is al dente and liquid is reduced and creamy, 11 to 13 minutes. If all the moisture cooks off and the pasta is still undercooked, add a splash of water.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel", "Add the zucchini back in:   \n\nAdd the cooked zucchini, lemon zest, and lemon juice and cook until warmed through, 2 minutes. Add a splash of water to create a thin, glossy sauce, if needed. Season to taste with salt and pepper, if needed. Divide between bowls and top with toasted walnuts. Serve.\n\n\nThough it’s best enjoyed immediately, you can always refrigerate leftovers in an airtight container for up to 3 days and reheat it in the microwave or in a saucepan with a splash of water.\n\n\nDid you love the recipe? Leave us stars below! \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Alison Bickel"]}, {"title": "Dukkah-Spiced Salmon with Lemony Couscous", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/dukkah-spiced-salmon-recipe-5216626", "image_url": "https://www.simplyrecipes.com/thmb/8FFxS_qwQjKDPgAYbq8x5yToqiQ=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Dukkah-Salmon-Couscous-LEAD-4-326b1af06e284cd7a47f44bc79d88746.jpg", "ingredients": ["1 cup plain yogurt", "1 1/2 teaspoons olive oil", "1 1/2 teaspoons fresh lemon juice", "1/4 cup mint leaves", "1/4 teaspoon kosher salt", " Pinch ground black pepper"], "instructions": ["Make the yogurt sauce:  \n\nIn a medium bowl, stir the yogurt, olive oil, lemon juice, mint, salt, and black pepper to combine. Taste and adjust seasoning with salt and black pepper. Cover with plastic wrap and chill it in the fridge for 30 minutes.", "Heat the water:  \n\nIn a small pot over high heat, add the water. Cover the pot with a lid and bring it to a boil. Lower the heat to a simmer. The boiled water will be used to cook the couscous.", "Meanwhile, start the couscous:  \n\nIn a medium (10-inch) pan over medium heat, add the oil, cinnamon stick, and bay leaves. They will sizzle and start changing color after about 10 to 12 seconds. Add the shallots and cook them for 2 to 3 minutes, stirring occasionally, until they are translucent. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Add couscous and raisins:  \n\nAdd the couscous and raisins and toast them for 3 to 4 minutes, stirring frequently. Add the salt, lemon zest, and boiled water. Once it comes up to a rolling boil, turn the heat down to a simmer, cover the pan with a lid, and cook for 7 to 8 minutes. At this point, the couscous won’t be cooked through.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Finish cooking the couscous:  \n\nRemove the lid and stir in the lemon juice. Put the lid back on and finish cooking it for 5 to 7 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Preheat the oven:  \n\nIf you like your salmon well-done, I recommend preheating the oven to 400°F to finish cooking it after pan searing.", "Season the salmon:  \n\nPat the salmon dry with a paper towel. Season both sides with salt and only the skinless side with dukkah. Use your hands to press gently to secure the dukkah onto the salmon. \n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Cook the salmon:  \n\nIn a large cast iron or nonstick skillet over medium-high heat, heat the oil. Gently add the salmon skin side-down and cook for 3 to 4 minutes until the skin is crispy. Use a spatula to carefully flip the salmon, and cook it for 3 to 4 minutes. This should give you a medium-rare salmon. \n\n\nFor a well-done salmon that is cooked through, but not dry, transfer the skillet into the preheated oven for 3 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh", "Serve:  \n\nTransfer the salmon onto plates and serve with the mint yogurt sauce and lemony couscous.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Prerna Singh"]}, {"title": "Chicken Salad with Tahini Dressing", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/weeknight-chicken-salad-with-tahini-dressing-recipe-5208621", "image_url": "https://www.simplyrecipes.com/thmb/Sykx06g6qoQ6nk87NK2Kp5WRnrg=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Weeknight-Chicken-Salad-Tahini-LEAD-11_RECIRC-c8304f2f516245d88a97c602509dfca8.jpg", "ingredients": ["2  scallions", "4 ounces daikon radish", "1/2 pound) romaine lettuce", "1  English cucumber", "2 cups cooked chicken", "1 tablespoon toasted sesame seeds"], "instructions": ["Prep the salad ingredients:  \n\nIn a small bowl of iced water, soak the scallions and radish until ready to use. This will keep them crisp.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Lori Rice", "Make the dressing:  \n\nIn a small bowl, whisk the tahini, water, soy sauce, toasted sesame oil, rice vinegar, honey, grated ginger and garlic, and salt until very smooth.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Lori Rice", "Assemble the salad:  \n\nDivide lettuce leaves, cucumbers, radishes, and shredded chicken between 4 serving plates. Drizzle each portion generously with tahini dressing. Top with drained and dried scallions, then garnish with toasted sesame seeds. Serve immediately.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Lori Rice"]}, {"title": "Grilled Oysters with Spicy Miso Butter", "time needed": "22 mins", "url": "https://www.simplyrecipes.com/grilled-oysters-with-spicy-miso-butter-recipe-5199867", "image_url": "https://www.simplyrecipes.com/thmb/17kTWvptPaAaPBArgICjv7ik9ig=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Grilled-Oysters-Spicy-Miso-LEAD-14-3d7edbd2d67f4788b3e27823c4cc9fba.jpg", "ingredients": ["2 dozen medium to large fresh oysters", "4 tablespoons unsalted butter", "2 teaspoons miso paste", "1 1/2 teaspoons sriracha", "1 large lime, zested", "1  baguette"], "instructions": ["Preheat your grill:  \n\nIf you’re using a gas grill, turn it to high, cover with the lid and let preheat for 10 minutes.\n\n\nIf using a charcoal grill, light the coals and let them get hot. The grill is hot enough when you hold your hand an inch above the grill grates and can only leave it there for a few seconds.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Make the miso butter:  \n\nIn a small bowl combine the butter, miso paste, and sriracha using a fork until well blended. Set aside until ready to use.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Clean the oysters:  \n\nRinse the oysters under cold running water. Use a scrub brush or kitchen towel to slough off any dirt.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Grill the oysters:  \n\nPlace the oysters on the hot grill, flat-side up, and cover with the lid. Cook until the oysters crack open. They won’t necessarily open wide like a clam, just look for a little crack.\n\n\nOccasionally an oyster refuses to open. Not to worry, it will be fully cooked, and you can wedge it open using an oyster knife. If you open the oyster and it smells “off” or unpleasant, toss it out.\n\n\nThe time will vary depending on the heat of the grill and size of the oysters, 3 to 6 minutes.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Transfer to a platter and open oysters:  \n\nUse tongs to transfer the oysters to a platter, including any oysters that haven’t cracked open (they are fully cooked and are fine to eat unless they have an unpleasant smell).\n\n\nWhen the oysters are cool enough to handle, use an oyster or paring knife to pry the flat lid off each oyster and loosen it from the shell. Do your best not to spill the tasty oyster juices. You want each oyster tucked into the well of its shell. Discard the flat top shell.\n\n\nAny oysters that haven't opened should be fairly easy to wedge open. Hold each unopened oyster using a sturdy kitchen towel to protect your hand and insert an oyster knife in the narrow end of the shell. Wiggle until the shell lifts off.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nMike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Spoon miso butter onto oysters and return to grill:  \n\nSpoon about 1/2 teaspoon of miso butter onto each oyster and set on the grill using tongs. Cover and grill until the butter bubbles, 30 to 60 seconds.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nMike Lang\n\n\n\n\n\n\n\n\n\n\n\n\nMike Lang", "Transfer to a platter:  \n\nSpread uncooked rice or a rock salt over a large platter to help stabilize the oysters. (If you want to.) Place the oysters on top and add a little lime zest over the top.", "Serve:  \n\nServe with the baguette, to be torn and dunked into the melted miso butter that lingers in the shells.\n\n\n\n\n\n\n\n\n\n\n\nMike Lang"]}, {"title": "Baked Tilapia in Lemon Butter Sauce", "time needed": "20 mins", "url": "https://www.simplyrecipes.com/baked-tilapia-in-lemon-butter-sauce-recipe-5185722", "image_url": "https://www.simplyrecipes.com/thmb/9m4C_bgQRbxdp66puH3FwMO42XM=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Lemon-Butter-Baked-Tilapia-LEAD-10-76c86a6b5e694984be3c1ea9bca64d2d.jpg", "ingredients": ["1 1/2 pounds tilapia fillets", "1/4 teaspoon kosher salt", "1/8 teaspoon ground black pepper", "4 tablespoons unsalted butter", "1 tablespoon garlic", "4 teaspoons lemon juice"], "instructions": ["Preheat the oven and position rack:  \n\nPosition a rack in the center of the oven. Preheat the oven to 450°F.", "Pat fish dry and season:  \n\nPat the fish dry using a paper towel. In a large baking dish, arrange the fillets in a single layer, making sure they do not overlap. Season the fillets with salt and pepper. Set aside.\n\n\n\n\n\n\n\n\n\n\n\nLori Rice", "Make the butter sauce:  \n\nIn a small skillet over medium heat add the butter. Once the butter has melted add the garlic and cook until aromatic, about 2 minutes. Add the lemon juice and remove from the heat. Pour the sauce over the fish, trying to get the garlic bits on top of the fillets rather than the pan.\n\n\n\n\n\n\n\n\n\n\n\nLori Rice\n\n\n\n\n\n\n\n\n\n\n\n\nLori Rice", "Bake the fish:  \n\nBake the fish, until it is opaque and easily flakes apart when gently prodded, about 10 minutes. Serve immediately, spooning the sauce over the fish.\n\n\n\n\n\n\n\n\n\n\n\nLori Rice"]}, {"title": "Easy Baked Salmon", "time needed": "33 mins", "url": "https://www.simplyrecipes.com/easy-baked-salmon-recipe-5185107", "image_url": "https://www.simplyrecipes.com/thmb/NsyxQRGveXx9-YVG5cxYogUZO40=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Baked-Salmon-Side-LEAD-7-e74ef115669d4d96b716533bb292c661.jpg", "ingredients": ["2 pounds salmon fillet", "1 teaspoon salt", "1/2 teaspoon pepper", "4 tablespoons unsalted butter", "4 cloves garlic", "1 1/2 teaspoons honey", "1 1/2 teaspoons fresh lemon juice", "2 tablespoons fresh herbs"], "instructions": ["Arrange rack, preheat the oven, and prepare the baking sheet:  \n\nPlace the rack in the middle of the oven. Preheat the oven to 375°F. Line a large-rimmed baking sheet with foil, being sure to leave several inches of overhang on both long ends to make your foil packet.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Prepare the salmon:  \n\nWhile the oven preheats, remove the salmon from the fridge to come to temperature, 15-20 minutes. Place the salmon on the prepared pan and pat both sides dry with a paper towel. Feel the flesh for any bones and remove them with fish tweezers or your fingers. \n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Season the salmon:  \n\nSeason both sides of the salmon with salt and pepper.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin\n\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Make the butter sauce and pour over salmon:  \n\nIn a small bowl, combine the melted butter, garlic, honey, and lemon juice. Fold up the edges of the foil to contain the liquid and pour the butter mixture evenly over the top of the salmon.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin\n\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Seal the salmon with foil:  \n\nBring the two long sides of the foil together and then fold them down a few times to close the top of your packet. Then, tuck each end under to close the sides. If your piece of foil is not large enough, take a second sheet of foil and cover the salmon, pinching the foil to seal the edges.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin\n\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin\n\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Bake the salmon:  \n\nIf you’re cooking farm-raised salmon, it should be done in 18-20 minutes, depending on the thickness. If you’re using wild-caught salmon, check for doneness beginning at 10 minutes. If you open the packet and see the fish isn’t finished cooking, it should be opaque on top and flake easily with a fork, close the foil packet back up, return it to the oven, and check again in another 2-3 minutes.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Broil the salmon:  \n\nCarefully open the foil package to uncover the salmon completely, pushing the foil down and out of the way.\n\n\nSet the oven to broil on high. If you have an electric stove, return the salmon to the oven, still on the middle rack. Broil the salmon for 2-3 minutes. You’ll see it turn just slightly golden with some charred spots but be sure not to burn the garlic.\n\n\nIf you have a gas stove, you may want to reduce your broiling time to 1 minute or skip it all together.\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin", "Serve:  \n\nLet the salmon rest for about 5 minutes. Garnish with chopped herbs. Transfer to a serving platter or serve directly from the pan!\n\n\n\n\n\n\n\n\n\n\n\nKalisa Marie Martin"]}, {"title": "Shakshuka with Feta, Olives, and Peppers", "time needed": "50 mins", "url": "https://www.simplyrecipes.com/shakshuka-with-feta-olives-and-peppers-5114919", "image_url": "https://www.simplyrecipes.com/thmb/9QJgF7cf5_jKHfYr4jOqnePxnnY=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Shakshuka-Feta-Olives-LEAD-6-f93bec449f724b3fbba07dbe6ecdfc56.jpg", "ingredients": ["2 tablespoons olive oil", "1 teaspoon smoked paprika", "1 teaspoon ground cumin", "1/4 teaspoon Aleppo pepper flakes", "1 large yellow onion", "2 cloves garlic", "1  red bell pepper", "1  yellow bell pepper", "28 ounces) tomatoes", "1/2 teaspoon salt", "4 ounces feta cheese", "1/3 cup olives in brine", "4 large eggs"], "instructions": ["Cook the onion and peppers:  \n\nIn a large skillet over medium heat, heat the oil. Add the paprika, cumin, and pepper flakes and cook for 30 seconds to a minute to bloom the spices.\n\n\nAdd the onion and cook, stirring occasionally, for 3 minutes. Add the garlic, red pepper, and yellow pepper and cook, stirring occasionally, for 15 minutes, or until the vegetables soften.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Crush the tomatoes and simmer them with the peppers:  \n\nIn a bowl, break up the tomatoes with your hands. Add them to the skillet with the salt and cook for 5 minutes. Taste and add more salt, if you prefer.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Cook the eggs:  \n\nWith the back of a spoon or a ladle, make 4 indentations in the sauce.\n\n\nBreak an egg into a cup and carefully pour it into and indentation, being careful not to break the yolk. Repeat with the remaining eggs. (You can crack the egg directly into the sauce and skip the cup, but it’s easier to get a an errant egg shell or protect the dish from a bad egg if you use the cup method.)\n\n\nSprinkle the feta and olives around the eggs. Cover the pan and simmer over medium heat for 8 minutes, or until the whites are set and the yolks are still soft. (If you like your eggs well done, cook for a minute or two longer.)\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "To serve:  \n\nGarnish with cilantro leaves and a sprinkling of red pepper flakes. Bring to the table and serve from the pan."]}, {"title": "Enfrijoladas with Black Beans, Avocado and Cotija", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/enfrijoladas-with-black-beans-avocado-and-cotija-5114420", "image_url": "https://www.simplyrecipes.com/thmb/pEqeAfeXpUaWleez2Cy0BqQv2Vk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Black-Bean-Enfrijoladas-LEAD-4-a05f54ec291c4788af9be1b03d43f665.jpg", "ingredients": ["1 tablespoon extra virgin olive oil", "1 large red onion", "2 cloves garlic", "1 chili chipotle", "2 15-ounce cans black bean", "2 tablespoons lime juice", "1/2 teaspoon ground cumin", "1 teaspoon kosher salt", "8 tortillas corn", "2 avocados avocados", "1/2 cup cotija cheese", "1/3 cup salsa", "1/3 cup sour cream", "1/3 cup chopped cilantro"], "instructions": ["Sauté the onion and garlic:  \n\nHeat the olive oil in a large skillet over medium. Add 3/4 of the sliced onion and sauté until nearly tender, about 5 minutes. Add the garlic and sauté to soften, 2 minutes.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Blend the sauce:  \n\nTransfer the cooked onion and garlic to a blender along with the beans, including the bean liquid, chipotle, lime juice, cumin, salt, and 1/2 cup water. Blend until smooth and creamy. Taste and add more salt if needed, then blend again. \n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Heat the sauce:  \n\nTransfer the beans back to the large skillet set over low heat. Cook for 4 to 6 minutes at simmer. The sauce should be the texture of a thick soup. Add more water, if needed, to thin to the appropriate consistency.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Assemble the dish:  \n\nUse a pair of tongs to heat a tortilla over a gas flame or in a dry skillet set over high heat until it begins to blister. Submerge the tortilla in the bean sauce, smothering it completely. Use a spatula to fold it in half and transfer to a dinner plate. Top with a tablespoon of cotija, a slice or 2 of avocado, and a tangle of raw sliced onions. Continue with remaining tortillas and bean sauce, figuring 2 enfrijoladas per plate.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Serve:  \n\nServe immediately with the salsa, cilantro, sour cream and any remaining bean sauce for guests to add as they please."]}, {"title": "Easy Chicken Skillet Enchiladas", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/recipes/easy_chicken_skillet_enchiladas/", "image_url": "https://www.simplyrecipes.com/thmb/UHT7h5CWwnE4q5Qwq9sQnx6d5iU=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__05__Skillet-Chicken-Enchiladas-LEAD-3-7485c9c9621c48aaa6f4bf485d453e07.jpg", "ingredients": ["8 ounces cooked chicken", "1 teaspoon oil", "1/4  yellow onion", "3 cloves garlic", "1 (15-ounce) can tomato sauce", "1/3 cup water", "1 (4-ounce) can mild green diced chilis", "2 teaspoons chili powder", "1 teaspoon oregano", "1/2 teaspoon cumin", "8 taco-sized flour tortillas", "8 ounces cotija cheese"], "instructions": ["Shred chicken:  \n\nShred the leftover chicken so it’s ready when you need it. You should have about 2 cups.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel", "Make the sauce:  \n\nIn a large, high-sided skillet set over medium heat, add the oil. Once the oil shimmers, add onion and garlic and cook for 1 minute, just until softened.\n\n\nAdd tomato sauce, water, diced green chilis, chili powder, oregano, and cumin. Stir together, then let the sauce simmer on medium to medium-low while you assemble the enchiladas.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel", "Assemble the enchiladas:  \n\nPut about 2 tablespoons of shredded chicken down the center of each tortilla. (You don’t really have to measure the meat. Just divide it evenly among the tortillas!) Sprinkle about 1 tablespoon cotija cheese (just eyeball it) across the chicken, and spoon 1-2 teaspoons sauce over the cheese.\n\n\nFold in the sides of the tortilla, roll it up, and put it seam side down in the sauce. Nestle them in the pan. Repeat this until the pan is full. Spoon sauce over the top of the enchiladas.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel", "Top with cheese and cover:  \n\nSprinkle additional cotija cheese over the top of the enchiladas. Cover with a lid and let them simmer until the cheese is melted and the tortillas look puffy, like they soaked up some sauce. This should take about 5 minutes.\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel\n\n\n\n\n\n\n\n\n\n\n\n\nAlison Bickel", "Garnish and serve:  \n\nLift the lid and sprinkle cilantro and thinly sliced radishes over the top. Serve alongside sliced avocado, jalapeño, and sour cream."]}, {"title": "How to Make a Burger on the Stove", "time needed": "15 mins", "url": "https://www.simplyrecipes.com/how-to-make-a-burger-on-the-stove-6890850", "image_url": "https://www.simplyrecipes.com/thmb/zmkOz7fMVKtOrEFb1u-1JwyCMkk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Burger-On-Stovetop-LEAD-02-f2735a5ada4e43cfb361dc0cfad246d3.jpg", "ingredients": ["1 tablespoon kosher salt", "1 tablespoon black pepper", "1 teaspoon garlic powder"], "instructions": ["Prepare the optional burger seasoning mix:  \n\nBefore you start cooking, prepare the seasoning mix. In a small bowl, mix together the salt, pepper, and garlic powder. Set aside.", "Make the sauce:  \n\nIn another small bowl, mix the mayonnaise, mustard, and ketchup together until smooth. Set aside.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Form the burgers:   \n\nPreheat a large sturdy skillet (cast iron is best) over medium heat. \n\n\nLoosely divide the ground beef into three 1/3-pound patties. Shape into discs about 1/2 inch thick and put a divot in the center of each patty to prevent swelling in the center. Season the patties with 1/2 teaspoon of seasoning mix per side of the patty, if using.\n\n\n\nSimple Tip!\n\nYou’ll have more seasoning mix than you need, but it keeps, tightly sealed, for up to 1 year.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Cook the burgers:   \n\nTurn on the fan over the stove and open a window to help with air flow. \n\n\nSpray your skillet with a little non-stick spray and place burgers in the skillet. Press down on each patty with a spatula for 10 seconds. This is to encourage browning. \n\n\nCook the burgers over medium heat for 4 minutes. Don’t touch them too much so you get a nice crust on the first side. Use a sturdy metal spatula to flip the burgers, being sure to scrape up any caramelization with the burger.", "Flip the burgers:  \n\nAfter you flip the burgers, add the cheese, if using, and continue to cook for 3 minutes until the burger is cooked to desired doneness, usually medium. \n\n\nIf you are only cooking one burger, you can toast your buns in the same skillet as your patty, or you can toast them separately if you are cooking multiple burgers at once.\n\n\nIf you want the cheese to be very melted, cover the burgers with a lid for the last minute of cooking.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans", "Build the burgers and serve:  \n\nBuild your burgers by spreading some burger sauce on each bun. Put the burgers on the bottom bun and top with the lettuce, onions, tomatoes, and the top bun. Serve immediately with a cold drink.\n\n\nDid you love this recipe? Give us some stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Nick Evans"]}, {"title": "Egg Foo Young", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/egg-foo-young-recipe-6890222", "image_url": "https://www.simplyrecipes.com/thmb/NTEZ-w_JQJVlp_VRLKb41O5XrSc=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Egg-Foo-Young-LEAD-03-216cfd87dc784584a02c9431cdf06d74.jpg", "ingredients": ["1 cup beef stock", "1 tablespoon soy sauce", "1 tablespoon Shaoxing wine", "1 tablespoon oyster sauce", "1/2 teaspoon white pepper", "1 tablespoon cornstarch", "1 tablespoon water"], "instructions": ["Make the gravy:  \n\nIn a small saucepan, add the beef stock, soy sauce, Shaoxing wine, oyster sauce, and white pepper powder over medium heat. Whisk together and bring to a simmer. \n\n\nCombine the cornstarch and water in a small bowl and whisk to dissolve. Add to the saucepan and whisk until the gravy thickens and coats the back of the spoon, 2 to 3 minutes. Cover the saucepan with a lid and keep it warm on the lowest possible heat.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Make the egg foo young batter:  \n\nIn a medium bowl, whisk together the cornstarch and water until dissolved. Add the eggs, salt, and sugar. Whisk until well combined and there are no more egg white clumps. \n\n\nAdd the green onion, bean sprouts, and shrimp. Stir until everything is evenly coated.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Fry the egg foo young:  \n\nAdd the vegetable oil to a large wok; it should reach about 2 inches up the sides. Heat the oil over medium-high heat to 350°F, or until vigorous bubbles form around an inserted wooden chopstick. \n\n\nWith a ladle, gently and slowly add 1/4 of the omelet batter. Egg foo young should immediately bubble and puff up like magic. Fry until golden brown and crispy on each side, about 2 minutes per side. If there are any light spots, use a ladle to gently baste it with hot oil.\n\n\n\nSimple Tip!\n\nEgg foo young can be a bit tricky to flip. The easiest method is to put a tool in each hand (a spider, slotted spoon, tongs, and large chopsticks are all good candidates) and gently coax the omelet over, pulling up on one side and pushing down and around on the other.\n\n\nRemove the omelet and place it on a paper towel-lined baking sheet. Let it cool for 5 minutes. Meanwhile, repeat with the remaining batter to make 4 omelets. If needed, add more oil to the pan between batches.\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu\n\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu", "Serve and enjoy:  \n\nPlate each egg foo young over a bed of rice. Spoon the warm gravy over the top and serve immediately. \n\n\nLove the recipe? Leave us stars below!\n\n\n\n\n\n\n\n\n\n\n\nSimply Recipes / Frank Tiu"]}, {"title": "Steak Noodle Bowls with Miso-Lime Dressing", "time needed": "25 mins", "url": "https://www.simplyrecipes.com/recipes/steak_noodle_bowls_with_miso_lime_dressing/", "image_url": "https://www.simplyrecipes.com/thmb/7MdInBQM_Exq9hKg6MMXaIj06MI=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__08__steak-noodle-bowl-lead2-1-f4d927538c184280942b3362a8a66cfd.jpg", "ingredients": null, "instructions": ["Make the dressing:  \n\nIn a blender or the bowl of a food processor pulse the ginger and garlic until finely chopped. Add the lime juice, water, miso, soy sauce, brown sugar, olive oil, and sesame oil. Blend or process until smooth.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Cook the steak:  \n\nPat the steak dry and sprinkle with salt and pepper on both sides. In a cast-iron or non-stick skillet over medium-high heat, heat the oil. Add the steak and cook for 3 minutes, or until browned. Turn over and cook on the other side for 3 to 4 minutes, or until an instant-read thermometer inserted into the center of the steak registers 135oF for medium-rare.\n\n\nSet aside and let rest for at least 5 minutes while you prepare the noodles. (The temperature will rise a few degrees as the steak rests.) Cut across the grain into thin slices.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Trim the snap peas:  \n\nRemove and discard the stem end and string from each of the snap pea pods. (Note, if you don’t mind the strings, you can skip this step.)", "Cook the noodles and snap peas, and wilt the spinach:  \n\nBring a large pot of salted water to a boil. Remove the pot from the heat and add the noodles and snap peas. Cover the pot and let sit for 3 minutes. With a slotted spoon, transfer the snap peas (they will float on top of the noodles) to a colander and rinse under cold running water. Drain well and transfer to a large bowl.\n\n\nCover the pot again and let the noodles soak for another 4 to 5 minutes. (See package directions for precise amount of total time for the noodle brand you are using.) Stir in the spinach leaves, which will immediately wilt a little. Drain the noodles and spinach in a colander, rinse under cold water and drain again. Transfer to the bowl with the snap peas.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Assemble and serve the salad:  \n\nAdd the cucumbers, mint, cilantro, and sliced steak to the bowl with the noodles. Toss to combine. Taste and add more salt, if you like. Divide among four bowls and sprinkle each with more mint, cilantro, and sesame seeds. Serve the dressing on the side so each person can add as much or as little as they want."]}, {"title": "Chicken Breasts With Mustard Cream Sauce", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/recipes/chicken_breasts_with_mustard_cream_sauce/", "image_url": "https://www.simplyrecipes.com/thmb/qaXxnWqyMFVqMrJHblupGVzhB0c=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2017__04__2017-05-17-ChickenMustardSauce-7-66f9d78ec4a24d3587852cfed6643730.jpg", "ingredients": ["4 breasts skinless, boneless chicken", "to taste  Salt and pepper", "1/4 cup all-purpose flour", "1 1/2 tablespoons unsalted butter", "1 1/2 tablespoons oil", "1 cup white wine", "1 cup heavy cream", "1 rounded teaspoon Dijon mustard", "3 tablespoons capers", "2 tablespoons fresh parsley"], "instructions": ["Heat the oven:  \n\nto 350F. Place a baking sheet near the stove, ready for the chicken.", "Prepare the chicken:  \n\nSeason the chicken breasts on both sides with salt and pepper.\n\n\nPour the flour onto a large plate and dredge the chicken breasts until well coated. Shake off the excess.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Brown the chicken:  \n\nIn a large skillet over medium high-heat, heat the butter and oil. When the butter has melted and looks foamy, add the chicken. (Work in batches if your pan isn't big enough so that you don't crowd the pan.)\n\n\nBrown the chicken for 3 minutes per side, or until golden.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas\n\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Finish the chicken in the oven:  \n\nTransfer the chicken to the baking sheet and place in the oven for 5 minutes (longer if the chicken breasts are thick), or until a thermometer inserted into the thickest part of a breast registers 165 degrees.\n\n\nIf the chicken is done before the sauce, transfer it to a serving platter and tent it loosely with foil to keep warm.", "Make the sauce:  \n\nWhile the chicken finishes cooking, return the skillet to medium heat and add the wine. Be careful since the oil in the pan will sputter a little when you add the wine. Cook for 5 minutes, or until the wine is reduced by about half.\n\n\nAdd the cream and simmer for 2 to 3 minutes, or until the sauce coats the back of a spoon.\n\n\nStir in the mustard, capers and parsley, reserving a little parsley for sprinkling over top. Taste and add more salt and pepper, if you like.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas", "Serve the chicken:  \n\nPlace each chicken breast on a plate, drizzle with the sauce, and sprinkle with the remaining parsley.\n\n\n\n\n\n\n\n\n\n\n\nSally Vargas"]}, {"title": "Pasta Carbonara", "time needed": "30 mins", "url": "https://www.simplyrecipes.com/recipes/spaghetti_alla_carbonara/", "image_url": "https://www.simplyrecipes.com/thmb/5g5Sm-QPNa0YtL80j7WCypCOVM8=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Spaghetti-Carbonara-LEAD-7-82d6bacf7f3848a4943b14712ab205ff.jpg", "ingredients": ["1 tablespoon extra virgin olive oil", "1/2 pound pancetta", "1 to 2 cloves garlic", "3 to 4  whole eggs", "1 cup grated", "1 pound spaghetti", "to taste  Kosher salt and freshly ground black pepper"], "instructions": ["Heat the pasta water:  \n\nPut a large pot of salted water on to boil (1 tablespoon salt for every 2 quarts of water.)", "Sauté the pancetta or bacon and garlic:  \n\nWhile the water is coming to a boil, heat the olive oil or butter in a large sauté pan over medium heat. Add the bacon or pancetta and cook slowly until crispy.\n\n\nAdd the garlic (if using) and cook another minute, then turn off the heat and put the pancetta and garlic into a large bowl.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan", "Beat the eggs and half of the cheese:  \n\nIn a small bowl, beat the eggs and mix in about half of the cheese.", "Cook the pasta:  \n\nOnce the water has reached a rolling boil, add the dry pasta, and cook, uncovered, at a rolling boil.", "Toss the pasta with pancetta or bacon:  \n\nWhen the pasta is al dente (still a little firm, not mushy), use tongs to move it to the bowl with the bacon and garlic. Let it be dripping wet. Reserve some of the pasta water.\n\n\nMove the pasta from the pot to the bowl quickly, as you want the pasta to be hot. It's the heat of the pasta that will heat the eggs sufficiently to create a creamy sauce.\n\n\nToss everything to combine, allowing the pasta to cool just enough so that it doesn't make the eggs curdle when you mix them in. (That's the tricky part.)\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan", "Add the beaten egg mixture:  \n\nAdd the beaten eggs with cheese and toss quickly to combine once more. Add salt to taste. Add some pasta water back to the pasta to keep it from drying out.\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan\n\n\n\n\n\n\n\n\n\n\n\n\nKarishma Pradhan\n\n\n\nServe at once with the rest of the parmesan and freshly ground black pepper. If you want, sprinkle with a little fresh chopped parsley."]}, {"title": "Quick Easy Fish Stew", "time needed": "34 mins", "url": "https://www.simplyrecipes.com/recipes/dads_fish_stew/", "image_url": "https://www.simplyrecipes.com/thmb/_tc5rnDwzCCkpTuV6cXWTZU_3tY=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2016__02__dads-fish-stew-horiz-a-1600-8cf962c81e084558a025bf8392e00f32.jpg", "ingredients": ["6 tablespoons extra virgin olive oil", "1 medium onion", "3 cloves cloves", "2/3 cup parsley leaves, chopped", "1 1/2 cups fresh chopped tomato", "2 teaspoons tomato paste", "1 (8-ounce) clam juice", "1/2 cup Sauvignon blanc", "1 1/2 pounds halibut", " Pinch dried oregano", " Pinch dried thyme", "1/8 teaspoon Tabasco sauce", "1/8 teaspoon ground black pepper,", "1 teaspoon salt,"], "instructions": ["Saute the aromatics in olive oil:  \n\nHeat olive oil in a large, thick-bottomed pot over medium-high heat. Add onion and sauté 4 minutes. Add the garlic and cook a minute more. Add parsley and stir 2 minutes. Add tomato and tomato paste, and gently cook for 10 more minutes or so.\n\n\n\n\n\n\n\n\n\n\n\nMichelle Becker\n\n\n\n\n\n\n\n\n\n\n\n\nMichelle Becker\n\n\n\n\n\n\n\n\n\n\n\n\nMichelle Becker", "Finish the soup:  \n\nAdd clam juice, dry white wine, and fish. Bring to a simmer, and let simmer until the fish is cooked through and easily flakes apart, about 3 to 5 minutes. Add seasoning — salt, pepper, oregano, thyme, and Tabasco. Add more salt and pepper to taste.\n\n\n\n\n\n\n\n\n\n\n\nMichelle Becker", "Serve the stew:  \n\nLadle into individual bowls and serve.\n\n\nGreat served with crusty bread for dipping in the fish stew broth.\n\n\n\n\n\n\n\n\n\n\n\nMichelle Becker"]}, {"title": "Shrimp Scampi", "time needed": "15 mins", "url": "https://www.simplyrecipes.com/recipes/shrimp_scampi/", "image_url": "https://www.simplyrecipes.com/thmb/kjpwGp5gcpDeBe2e9y-ktrDRlLk=/300x225/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2015__03__shrimp-scampi-horiz-a-1200-e9c7d32065c74ee5a0f174b3bc3af0d1.jpg", "ingredients": ["1 pound large raw shrimp", "2 tablespoons extra virgin olive oil", "2 to 3 tablespoons butter", "  Salt", "3 to 4 cloves garlic", "1/4 to 1/2 teaspoon red pepper flakes", "1/2 cup white wine", "2 tablespoons parsley", "to taste  ground black pepper,", "1 tablespoon lemon juice"], "instructions": ["Sauté the garlic and red pepper flakes in butter and olive oil:  \n\nHeat a sauté pan on high heat then reduce to medium high heat. Swirl the butter and olive oil into the pan. After the butter melts it will foam up a bit then subside. If using unsalted butter, sprinkle a little salt in the pan. Stir in the slivered garlic and red pepper flakes.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "Add the shrimp and white wine:  \n\nSauté the garlic for just a minute, until it begins to brown lightly on the edges, then add the shrimp.\n\n\nAdd the wine and stir to coat the shrimp.\n\n\nMove the shrimp, so they are in an even layer in the pan. Increase the heat to high and boil the wine for about two minutes.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "Turn the shrimp over to cook the other side:  \n\nStir the shrimp and arrange them so you turn them over to cook on the other side. Continue to cook on high heat for another minute.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "Toss with parsley, lemon juice, and pepper:  \n\nRemove the pan from the heat. Sprinkle the shrimp with parsley, lemon juice, and black pepper, and toss to combine.\n\n\n\n\n\n\n\n\n\n\n\nElise Bauer", "Serve hot with bread, pasta or rice:  \n\nServe as is, or with crusty bread, over pasta, or over rice (for a gluten-free version)."]}]